-- lua header. UTF-8 인코딩 인식을 위해 이 줄은 지우지 마세요.		
		
NEW_ITEM = 		
{		
210570,--얼음 조각상 가열기 10+3 큐브		
210560,--얼음 조각상 가열기 5+1 큐브		
210550,--얼음 조각상 가열기 1+1 큐브	
207500,--얼음조각상가열기

85002441,--	얼음 조각상 가열기(레이븐, 이브, 청 나소드 배틀 슈트)
85002451,--	얼음 조각상 가열기(나소드 배틀 슈트)


235210	,--	엘소드 샤니베어 슬리핑 소드(하늘)
235220	,--	엘소드 샤니베어 파자마 상의(하늘)
235230	,--	엘소드 샤니베어 파자마 하의(하늘)
235240	,--	엘소드 샤니베어 손목 시계(하늘)
235250	,--	엘소드 샤니베어 슬리퍼(하늘)
235260	,--	엘소드 샤니베어 파자마 두건(하늘)
235270	,--	엘소드 샤니베어 슬리핑 소드(주황)
235280	,--	엘소드 샤니베어 파자마 상의(주황)
235290	,--	엘소드 샤니베어 파자마 하의(주황)
235300	,--	엘소드 샤니베어 손목 시계(주황)
235310	,--	엘소드 샤니베어 슬리퍼(주황)
235320	,--	엘소드 샤니베어 파자마 두건(주황)
235330	,--	아이샤 러블리 캣 스태츄(분홍)
235340	,--	아이샤 러블리 캣 파자마 상의(분홍)
235350	,--	아이샤 러블리 캣 파자마 하의(분홍)
235360	,--	아이샤 러블리 캣 방울(분홍)
235370	,--	아이샤 러블리 캣 슬리퍼(분홍)
235380	,--	아이샤 러블리 캣 슬리핑 캡(분홍)
235390	,--	아이샤 러블리 캣 스태츄(보라)
235400	,--	아이샤 러블리 캣 파자마 상의(보라)
235410	,--	아이샤 러블리 캣 파자마 하의(보라)
235420	,--	아이샤 러블리 캣 방울(보라)
235430	,--	아이샤 러블리 캣 슬리퍼(보라)
235440	,--	아이샤 러블리 캣 슬리핑 캡(보라)
235450	,--	레나 나이트블룸 프릴보우(노랑)
235460	,--	레나 나이트블룸 파자마 상의(검정)
235470	,--	레나 나이트블룸 파자마 하의(검정)
235480	,--	레나 나이트블룸 사파이어 팔찌(분홍)
235490	,--	레나 나이트블룸 슬리퍼(노랑)
235500	,--	레나 나이트블룸 양갈래 리본 헤어(노랑)
235510	,--	레나 나이트블룸 프릴보우(분홍)
235520	,--	레나 나이트블룸 파자마 상의(분홍)
235530	,--	레나 나이트블룸 파자마 하의(분홍)
235540	,--	레나 나이트블룸 사파이어 팔찌(하늘)
235550	,--	레나 나이트블룸 슬리퍼(분홍)
235560	,--	레나 나이트블룸 양갈래 리본 헤어(주황)
235570	,--	레이븐 하쉬드림 카타나(하늘)
235580	,--	레이븐 하쉬드림 가운 상의(하양)
235590	,--	레이븐 하쉬드림 가운 하의(하양)
235600	,--	레이븐 하쉬드림 금장 팔찌(노랑)
235610	,--	레이븐 하쉬드림 슬리퍼(하늘)
235620	,--	레이븐 하쉬드림 쉬크 헤어(고동)
235630	,--	레이븐 하쉬드림 카타나(주황)
235640	,--	레이븐 하쉬드림 가운 상의(주황)
235650	,--	레이븐 하쉬드림 가운 하의(주황)
235660	,--	레이븐 하쉬드림 은장 팔찌(은색)
235670	,--	레이븐 하쉬드림 슬리퍼(주황)
235680	,--	레이븐 하쉬드림 쉬크 헤어(은색)
235690	,--	이브 퓨어나잇 쉬프 기어(하양)
235700	,--	이브 퓨어나잇 블라우스(하양)
235710	,--	이브 퓨어나잇 하의(하양)
235720	,--	이브 퓨어나잇 반지 장식(빨강)
235730	,--	이브 퓨어나잇 슬리퍼(빨강)
235740	,--	이브 퓨어나잇 애플 헤어(검정)
235750	,--	이브 퓨어나잇 쉬프 기어(하늘)
235760	,--	이브 퓨어나잇 블라우스(하늘)
235770	,--	이브 퓨어나잇 하의(하늘)
235780	,--	이브 퓨어나잇 반지 장식(분홍)
235790	,--	이브 퓨어나잇 슬리퍼(하늘)
235800	,--	이브 퓨어나잇 애플 헤어(하양)
235810	,--	청 래핑카우 필로우 캐논(하양)
235820	,--	청 래핑카우 파자마 상의(하양)
235830	,--	청 래핑카우 파자마 하의(하양)
235840	,--	청 래핑카우 방울(노랑)
235850	,--	청 래핑카우 슬리퍼(하양)
235860	,--	청 래핑카우 슬리핑 캡(하양)
235870	,--	청 래핑카우 필로우 캐논(노랑)
235880	,--	청 래핑카우 파자마 상의(노랑)
235890	,--	청 래핑카우 파자마 하의(노랑)
235900	,--	청 래핑카우 방울(은색)
235910	,--	청 래핑카우 슬리퍼(노랑)
235920	,--	청 래핑카우 슬리핑 캡(노랑)

250000000	,--	오픈 웨딩 카 캐논(빨강)
250000001	,--	노블레스 연미복 상의(하양)
250000002	,--	노블레스 연미복 하의(하양)
250000003	,--	실크 웨딩 장갑(하양)
250000004	,--	화이트 포인트 구두(하양)
250000005	,--	스트레이트 스타일링 헤어(연보라)
250000010	,--	오픈 웨딩 카 캐논(파랑)
250000011	,--	노블레스 연미복 상의(검정)
250000012	,--	노블레스 연미복 하의(검정)
250000013	,--	실크 웨딩 장갑(검정)
250000014	,--	화이트 포인트 구두(검정)
250000015	,--	스트레이트 스타일링 헤어(연녹색)

233300	,--	엘소드 웨스턴 건맨 라이플 소드(고동)
233310	,--	엘소드 웨스턴 건맨 재킷(주황)
233320	,--	엘소드 웨스턴 건맨 진(고동)
233330	,--	엘소드 웨스턴 건맨 장갑(고동)
233340	,--	엘소드 웨스턴 건맨 롱부츠(고동)
233350	,--	엘소드 웨스턴 건맨 모자(고동)
233360	,--	엘소드 웨스턴 건맨 라이플 소드(갈색)
233370	,--	엘소드 웨스턴 건맨 재킷(와인)
233380	,--	엘소드 웨스턴 건맨 진(군청)
233390	,--	엘소드 웨스턴 건맨 장갑(하양)
233400	,--	엘소드 웨스턴 건맨 롱부츠(하양)
233410	,--	엘소드 웨스턴 건맨 모자(와인)
233420	,--	아이샤 웨스턴 아파치 스태프(파랑)
233430	,--	아이샤 웨스턴 건레이디 재킷(파랑)
233440	,--	아이샤 웨스턴 건레이디 팬츠(갈색)
233450	,--	아이샤 웨스턴 건레이디 장갑(갈색)
233460	,--	아이샤 웨스턴 건레이디 롱부츠(갈색)
233470	,--	아이샤 웨스턴 건레이디 모자(갈색)
233480	,--	아이샤 웨스턴 아파치 스태프(와인)
233490	,--	아이샤 웨스턴 건레이디 재킷(와인)
233500	,--	아이샤 웨스턴 건레이디 팬츠(하양)
233510	,--	아이샤 웨스턴 건레이디 장갑(하양)
233520	,--	아이샤 웨스턴 건레이디 롱부츠(연갈)
233530	,--	아이샤 웨스턴 건레이디 모자(와인)
233540	,--	레나 웨스턴 아파치 보우(갈색)
233550	,--	레나 웨스턴 카우걸 반다나 재킷(갈색)
233560	,--	레나 웨스턴 카우걸 숏스커트(갈색)
233570	,--	레나 웨스턴 카우걸 장갑(갈색)
233580	,--	레나 웨스턴 카우걸 숏부츠(갈색)
233590	,--	레나 웨스턴 카우걸 모자(갈색)
233600	,--	레나 웨스턴 아파치 보우(와인)
233610	,--	레나 웨스턴 카우걸 오픈 재킷(와인)
233620	,--	레나 웨스턴 카우걸 숏스커트(와인)
233630	,--	레나 웨스턴 카우걸 장갑(와인)
233640	,--	레나 웨스턴 카우걸 숏부츠(와인)
233650	,--	레나 웨스턴 카우걸 모자(와인)
233660	,--	레이븐 웨스턴 아파치 스피어(연갈)
233670	,--	레이븐 웨스턴 무법자 롱재킷(연갈)
233680	,--	레이븐 웨스턴 무법자 가죽 바지(회색)
233690	,--	레이븐 웨스턴 무법자 장갑(연갈)
233700	,--	레이븐 웨스턴 무법자 숏부츠(연갈)
233710	,--	레이븐 웨스턴 무법자 모자(고동)
233720	,--	레이븐 웨스턴 아파치 스피어(와인)
233730	,--	레이븐 웨스턴 무법자 롱재킷(와인)
233740	,--	레이븐 웨스턴 무법자 가죽 바지(고동)
233750	,--	레이븐 웨스턴 무법자 장갑(와인)
233760	,--	레이븐 웨스턴 무법자 숏부츠(와인)
233770	,--	레이븐 웨스턴 무법자 모자(와인)
233780	,--	이브 웨스턴 큐티홀스 기어(군청)
233790	,--	이브 웨스턴 쉐리프 블라우스(군청)
233800	,--	이브 웨스턴 쉐리프 진스커트(군청)
233810	,--	이브 웨스턴 쉐리프 장갑(군청)
233820	,--	이브 웨스턴 쉐리프 롱부츠(군청)
233830	,--	이브 웨스턴 쉐리프 롤링펌 헤어(검정)
233840	,--	이브 웨스턴 큐티홀스 기어(분홍)
233850	,--	이브 웨스턴 쉐리프 블라우스(고동)
233860	,--	이브 웨스턴 쉐리프 진스커트(하양)
233870	,--	이브 웨스턴 쉐리프 장갑(분홍)
233880	,--	이브 웨스턴 쉐리프 롱부츠(하양)
233890	,--	이브 웨스턴 쉐리프 롤링펌 헤어(하양)
233900	,--	청 웨스턴 카우보이 치프캐논(연갈)
233910	,--	청 웨스턴 카우보이 오픈 재킷(연갈)
233920	,--	청 웨스턴 카우보이 롱팬츠(연갈)
233930	,--	청 웨스턴 카우보이 장갑(연갈)
233940	,--	청 웨스턴 카우보이 숏부츠(연갈)
233950	,--	청 웨스턴 카우보이 모자(연갈)
233960	,--	청 웨스턴 카우보이 치프캐논(와인)
233970	,--	청 웨스턴 카우보이 오픈 재킷(와인)
233980	,--	청 웨스턴 카우보이 롱팬츠(와인)
233990	,--	청 웨스턴 카우보이 장갑(와인)
234000	,--	청 웨스턴 카우보이 숏부츠(와인)
234010	,--	청 웨스턴 카우보이 모자(와인)



250000430	,--	독일 디자인 컨테스트 「Thomas Rensen」 청 철포 (Ver.A)
250000431	,--	독일 디자인 컨테스트 「Thomas Rensen」 청 상의 (Ver.A)
250000432	,--	독일 디자인 컨테스트 「Thomas Rensen」 청 하의 (Ver.A)
250000433	,--	독일 디자인 컨테스트 「Thomas Rensen」 청 장갑 (Ver.A)
250000434	,--	독일 디자인 컨테스트 「Thomas Rensen」 청 신발 (Ver.A)
250000435	,--	독일 디자인 컨테스트 「Thomas Rensen」 청 헤어 (Ver.A)
250000440	,--	독일 디자인 컨테스트 「Thomas Rensen」 청 철포 (Ver.B)
250000441	,--	독일 디자인 컨테스트 「Thomas Rensen」 청 상의 (Ver.B)
250000442	,--	독일 디자인 컨테스트 「Thomas Rensen」 청 하의 (Ver.B)
250000443	,--	독일 디자인 컨테스트 「Thomas Rensen」 청 장갑 (Ver.B)
250000444	,--	독일 디자인 컨테스트 「Thomas Rensen」 청 신발 (Ver.B)
250000445	,--	독일 디자인 컨테스트 「Thomas Rensen」 청 헤어 (Ver.B)
	

}		
		
		
HOT_ITEM = 		
{
60005040	,--	엘소드 몬스터 카드 수집가의 모자
60005041	,--	아이샤 몬스터 카드 수집가의 모자
60005042	,--	레나 몬스터 카드 수집가의 모자
60005043	,--	레이븐 몬스터 카드 수집가의 모자
60005044	,--	이브 몬스터 카드 수집가의 모자
60005045	,--	청 몬스터 카드 수집가의 모자
60005029	,--	카드 수집가 가방 업그레이드권
85002328	,--	투사의 방패

84001270	,--	생명의 결정 (봉술 팬더-레드)
84001272	,--	봉술 팬더-레드
84001274	,--	생명의 결정 (봉술 팬더-레드) 특별 패키지
84001276	,--	봉술 팬더-레드 특별 패키지

242100	,--	퓨리 가디언 전직 변경권
242110	,--	슈팅 가디언 전직 변경권
242120	,--	쉘링 가디언 전직 변경권
242280	,--	아이언 팔라딘 전직 변경권
242290	,--	데들리 체이서 전직 변경권
242360	,--	쉘링 가디언의 결의

606013	,--	개량 연쇄반응탄
606014	,--	수호하는 마음가짐
606015	,--	3단 분열 유도탄
606016	,--	미완성 마구

133345	,--	드림 스텝 - 윈드
180001	,--	두근두근 하트 안경
233250	,--	웨스턴 건맨 미니미
233260	,--	웨스턴 건맨 라이플
233270	,--	웨스턴 건맨 다이너마이트 키트
237240	,--	머리 위의 고양이(코숏)
237250	,--	머리 위의 고양이(터키쉬)
237260	,--	머리 위의 고양이(샴)
237270	,--	머리 위의 고양이(봄베이)
244610	,--	홍조(뿌잉뿌잉)
244620	,--	홍조(새침)
251740	,--	블루 엔젤 귀요미 날개
251750	,--	핑크 엔젤 귀요미 날개


500300	,--	생명의 결정 (해츨링-라이트) 패키지

242350	,--	코드 일렉트라의 메모리
242070	,--	코드 액조틱 전직 변경권
242080	,--	코드 아키텍쳐 전직 변경권
242090	,--	코드 일렉트라 전직 변경권
242250	,--	코드 네메시스 전직 변경권
242260	,--	코드 엠프레스 전직 변경권

241610	,--	엘 분광결정
241620	,--	포톤 플레어
241630	,--	사우전드 스타

605013	,--	이중 자가 반응로
605014	,--	고출력 전자 빔
605015	,--	반응 가속
		
130716	,--	투지의 암 가드
131284	,--	맹세의 완장

500260	,--	생명의 결정 (해츨링-라이트)



133346	,--	드림 스텝 - 스타
181467	,--	러블리 락앤롤 기타
251720	,--	화이트 락앤롤 기타 
251730	,--	블랙 락앤롤 기타 
		
180151	,--	애완용 쁘띠뽀루
180295	,--	뽀루 망토

242340	,--	웨폰 테이커의 계시


241580	,--	연무 폭파
241590	,--	하푼 스피어
241600	,--	기가 프로미넌스

604013	,--	농밀한 화약
604014	,--	불 붙은 칼의 춤
604015	,--	패스트 리볼빙

500410	,--	조디악-에리스(양 자리)	
60003456	,--	당근당근
233280	,--	재미있는 당근 놀이
250000200	,--	롭이어 토끼 꼬리 (하양)
250000201	,--	롭이어 토끼 꼬리 (살색)
		

500320	,--	고스트 에인션트 뽀루-헬파이어
133344	,--	드림 스텝 - 플레어

209040	,--	빈티지 레더 크로스 백
234230	,--	반장 안경

500400	,--	조디악-파이시즈(물고기 자리)

244600	,--	다크서클
244630	,--	가슴을 적시는 눈물

500400	,--	조디악-파이시즈(물고기 자리)

207490	,--	앙증맞은 사슴 귀
500280	,--	생명의 결정 (해츨링-다크) 패키지
500240	,--	생명의 결정 (해츨링-다크)

243310	,--	드림 스텝 - 눈꽃
500390	,--	조디악-아쿠아리우스(물병 자리)

214400	,--	뽀루의 발 도장 (황금색)

215660	,--	코보 익스프레스 VIP 티켓
215670	,--	마나민트 츄잉껌
75000600	,--	마법의 목걸이
244560	,--	퀵슬롯 확장권
65000701	,--	루리엘의 신용 보증서

-- 펫
84001270	,--	생명의 결정 (봉술 팬더-레드)
84001272	,--	봉술 팬더-레드
84001274	,--	생명의 결정 (봉술 팬더-레드) 특별 패키지
84001276	,--	봉술 팬더-레드 특별 패키지


500260	,--	생명의 결정 (해츨링-라이트)
500300	,--	생명의 결정 (해츨링-라이트) 패키지


500230	,--	생명의 결정 (해츨링)
500150	,--	생명의 결정 (미스틱)
500020,--생명의 결정 (트리 나이트)		
	
500040,--엘의 나무 열매	

-- 1차 전직	
242360	,--	쉘링 가디언의 결의


214410,--소드 나이트의 증명		
214420,--매직 나이트의 증명		
242310	,--	시스 나이트의 증명
214430,--하이 매지션의 기억		
214440,--다크 매지션의 기억		
242320	,--	배틀 매지션의 기억
214450,--컴뱃 레인저의 영혼		
214460,--스나이핑 레인저의 영혼		
242330	,--	트래핑 레인저의 영혼
214470,--소드 테이커의 계시		
214480,--오버 테이커의 계시		
242340	,--	웨폰 테이커의 계시
214490,--코드 엑조틱의 메모리		
214500,--코드 아키텍처의 메모리
242350	,--	코드 일렉트라의 메모리
229460	,--	퓨리 가디언의 결의
229470	,--	슈팅 가디언의 결의	

-- 1차 전직 스킬
241640	,--	일레스틱 밤
241650	,--	빅뱅 스트림
241660	,--	카펫 바밍


	
213260,--아머브레이크		
213270,--대폭살		
213280,--메디테이션		
213290,--마나인테이크		
213300,--로우킥		
213310,--인탱글		
213360,--윈드밀		
213370,--소드파이어		
213380,--데스필드		
213390,--블리자드 샤워		
213400,--샤프폴		
213410,--윈드워드		
215210,--더블 슬래시		
215220,--피닉스 탤런		
215230,--에이징		
215240,--블레이즈 스탭		
215250,--바이올런트 어택		
215260,--궁그닐		
213320,--컷텐던		
213330,--웨폰브레이크		
213420,--쇼크웨이브		
213430,--발키리스자벨린		
215270,--블러디 액셀		
215280,--뉴클리어		
213340,--메탈더스트오라		
213350,--오베론가드		
213440,--아이언 스크랩스		
213450,--스페이스 랜치		
215290,--정크 브레이크		
215300,--헤븐즈 피스트	
229490	,--	가드
229500	,--	럼블샷
233170	,--	판데모니움
233190	,--	카밋 크래셔
233180	,--	칼라드볼그 페인
233200	,--	샤프슈터 신드롬	
241490	,--	하쉬 체이서
241500	,--	메일스톰 레이지
241510	,--	팬텀 소드
241520	,--	에너지 드레인
241530	,--	길로틴 프레스
241540	,--	매지컬 메이크업
241550	,--	폭발의 덫
241560	,--	페이탈리티
241570	,--	콜 오브 루인
241580	,--	연무 폭파
241590	,--	하푼 스피어
241600	,--	기가 프로미넌스
241610	,--	엘 분광결정
241620	,--	포톤 플레어
241630	,--	사우전드 스타

-- 2차 전직
216420,--로드나이트 임명장		
216430,--룬 슬레이어 징표		
217920,--엘리멘탈 마스터의 비약		
217930,--보이드 프린세스의 계약서		
217850,--윈드 스니커의 격투 교본		
217860,--그랜드 아처의 궁술 교본		
217950,--블레이드 마스터의 비전		
217960,--레크리스 피스트의 핵		
217970,--네메시스 블레이드		
217980,--엠프레스 티아라	
235120	,--	수호자의 형상
235130	,--	추적자의 형상	
		
228360,--	고통억제	
228370,--	마법저항수련	
228380,--	풍요의기운	
228390,--	극한의마나운용	
228400,--	자연과의친화	
228410,--	진동사격	
228420,--	긴급탈출!	
228430,--	승화된분노	
228440,--	집중의기운	
228450,--	충전추진기	
235080	,--	굳건한 의지
235090	,--	강렬한 쇼타임

-- 기술의 노트 및 메모			
221600,--기술의 노트		

606013	,--	개량 연쇄반응탄
606014	,--	수호하는 마음가짐
606015	,--	3단 분열 유도탄
606016	,--	미완성 마구

606010	,--	태풍과 같은 함성
606011	,--	자동감응탄
606012	,--	인내, 인내, 인내

	
601003,--끝없는 공격 그 이론과 실재		
601009,--정확하고 강한 타격		
601011,--갑옷 붕괴		
601004,--양적 향상에 대한 생각Ⅰ		
601010,--영혼 파괴		
601012,--꺼지지 않는 불길		
602003,--생각대로 미사일		
602009,--열기 폭발		
602011,--자유로운 영혼		
602004,--독을 쓸 때에는 자비심 없이		
602010,--리드미컬한 회전		
602012,--끝없는 갈망		
603003,--임계점 돌파		
603009,--급습		
603011,--명품 발차기		
603004,--뒤쫓기만 해서는 곤란		
603010,--공기 응축법		
603012,--덫 숙련		
604003,--어지러움에 면역		
604009,--약점 간파		
604011,--아물지 않는 상처		
604004,--폭파		
604010,--볼트 출력 강화		
604012,--효과적인 무기 파괴		
605003,--처음은 살살Ⅰ		
605004,--처음은 살살Ⅱ		
605009,--특제 나소드 고폭탄		
605010,--도움이 되기 위한 훈련		
605011,--짧고 굵게!		
605012,--오펜스 모드 전환!		
606003	,--	기합포
606004	,--	느와르 액션
601013	,--	꿰뚫는 검
601014	,--	치명적인 일격
601015	,--	칼의 비
602013	,--	파워 드레인
602014	,--	마력을 담은 망치질
602015	,--	에너지의 링
603013	,--	폭발물 취급 주의
603014	,--	추격하는 정령
603015	,--	재활용을 위한 준비
604013	,--	농밀한 화약
604014	,--	불 붙은 칼의 춤
604015	,--	패스트 리볼빙
605013	,--	이중 자가 반응로
605014	,--	고출력 전자 빔
605015	,--	반응 가속

--아바타
235210	,--	엘소드 샤니베어 슬리핑 소드(하늘)
235220	,--	엘소드 샤니베어 파자마 상의(하늘)
235230	,--	엘소드 샤니베어 파자마 하의(하늘)
235240	,--	엘소드 샤니베어 손목 시계(하늘)
235250	,--	엘소드 샤니베어 슬리퍼(하늘)
235260	,--	엘소드 샤니베어 파자마 두건(하늘)
235270	,--	엘소드 샤니베어 슬리핑 소드(주황)
235280	,--	엘소드 샤니베어 파자마 상의(주황)
235290	,--	엘소드 샤니베어 파자마 하의(주황)
235300	,--	엘소드 샤니베어 손목 시계(주황)
235310	,--	엘소드 샤니베어 슬리퍼(주황)
235320	,--	엘소드 샤니베어 파자마 두건(주황)
235330	,--	아이샤 러블리 캣 스태츄(분홍)
235340	,--	아이샤 러블리 캣 파자마 상의(분홍)
235350	,--	아이샤 러블리 캣 파자마 하의(분홍)
235360	,--	아이샤 러블리 캣 방울(분홍)
235370	,--	아이샤 러블리 캣 슬리퍼(분홍)
235380	,--	아이샤 러블리 캣 슬리핑 캡(분홍)
235390	,--	아이샤 러블리 캣 스태츄(보라)
235400	,--	아이샤 러블리 캣 파자마 상의(보라)
235410	,--	아이샤 러블리 캣 파자마 하의(보라)
235420	,--	아이샤 러블리 캣 방울(보라)
235430	,--	아이샤 러블리 캣 슬리퍼(보라)
235440	,--	아이샤 러블리 캣 슬리핑 캡(보라)
235450	,--	레나 나이트블룸 프릴보우(노랑)
235460	,--	레나 나이트블룸 파자마 상의(검정)
235470	,--	레나 나이트블룸 파자마 하의(검정)
235480	,--	레나 나이트블룸 사파이어 팔찌(분홍)
235490	,--	레나 나이트블룸 슬리퍼(노랑)
235500	,--	레나 나이트블룸 양갈래 리본 헤어(노랑)
235510	,--	레나 나이트블룸 프릴보우(분홍)
235520	,--	레나 나이트블룸 파자마 상의(분홍)
235530	,--	레나 나이트블룸 파자마 하의(분홍)
235540	,--	레나 나이트블룸 사파이어 팔찌(하늘)
235550	,--	레나 나이트블룸 슬리퍼(분홍)
235560	,--	레나 나이트블룸 양갈래 리본 헤어(주황)
235570	,--	레이븐 하쉬드림 카타나(하늘)
235580	,--	레이븐 하쉬드림 가운 상의(하양)
235590	,--	레이븐 하쉬드림 가운 하의(하양)
235600	,--	레이븐 하쉬드림 금장 팔찌(노랑)
235610	,--	레이븐 하쉬드림 슬리퍼(하늘)
235620	,--	레이븐 하쉬드림 쉬크 헤어(고동)
235630	,--	레이븐 하쉬드림 카타나(주황)
235640	,--	레이븐 하쉬드림 가운 상의(주황)
235650	,--	레이븐 하쉬드림 가운 하의(주황)
235660	,--	레이븐 하쉬드림 은장 팔찌(은색)
235670	,--	레이븐 하쉬드림 슬리퍼(주황)
235680	,--	레이븐 하쉬드림 쉬크 헤어(은색)
235690	,--	이브 퓨어나잇 쉬프 기어(하양)
235700	,--	이브 퓨어나잇 블라우스(하양)
235710	,--	이브 퓨어나잇 하의(하양)
235720	,--	이브 퓨어나잇 반지 장식(빨강)
235730	,--	이브 퓨어나잇 슬리퍼(빨강)
235740	,--	이브 퓨어나잇 애플 헤어(검정)
235750	,--	이브 퓨어나잇 쉬프 기어(하늘)
235760	,--	이브 퓨어나잇 블라우스(하늘)
235770	,--	이브 퓨어나잇 하의(하늘)
235780	,--	이브 퓨어나잇 반지 장식(분홍)
235790	,--	이브 퓨어나잇 슬리퍼(하늘)
235800	,--	이브 퓨어나잇 애플 헤어(하양)
235810	,--	청 래핑카우 필로우 캐논(하양)
235820	,--	청 래핑카우 파자마 상의(하양)
235830	,--	청 래핑카우 파자마 하의(하양)
235840	,--	청 래핑카우 방울(노랑)
235850	,--	청 래핑카우 슬리퍼(하양)
235860	,--	청 래핑카우 슬리핑 캡(하양)
235870	,--	청 래핑카우 필로우 캐논(노랑)
235880	,--	청 래핑카우 파자마 상의(노랑)
235890	,--	청 래핑카우 파자마 하의(노랑)
235900	,--	청 래핑카우 방울(은색)
235910	,--	청 래핑카우 슬리퍼(노랑)
235920	,--	청 래핑카우 슬리핑 캡(노랑)

250000000	,--	오픈 웨딩 카 캐논(빨강)
250000001	,--	노블레스 연미복 상의(하양)
250000002	,--	노블레스 연미복 하의(하양)
250000003	,--	실크 웨딩 장갑(하양)
250000004	,--	화이트 포인트 구두(하양)
250000005	,--	스트레이트 스타일링 헤어(연보라)
250000010	,--	오픈 웨딩 카 캐논(파랑)
250000011	,--	노블레스 연미복 상의(검정)
250000012	,--	노블레스 연미복 하의(검정)
250000013	,--	실크 웨딩 장갑(검정)
250000014	,--	화이트 포인트 구두(검정)
250000015	,--	스트레이트 스타일링 헤어(연녹색)

233300	,--	엘소드 웨스턴 건맨 라이플 소드(고동)
233310	,--	엘소드 웨스턴 건맨 재킷(주황)
233320	,--	엘소드 웨스턴 건맨 진(고동)
233330	,--	엘소드 웨스턴 건맨 장갑(고동)
233340	,--	엘소드 웨스턴 건맨 롱부츠(고동)
233350	,--	엘소드 웨스턴 건맨 모자(고동)
233360	,--	엘소드 웨스턴 건맨 라이플 소드(갈색)
233370	,--	엘소드 웨스턴 건맨 재킷(와인)
233380	,--	엘소드 웨스턴 건맨 진(군청)
233390	,--	엘소드 웨스턴 건맨 장갑(하양)
233400	,--	엘소드 웨스턴 건맨 롱부츠(하양)
233410	,--	엘소드 웨스턴 건맨 모자(와인)
233420	,--	아이샤 웨스턴 아파치 스태프(파랑)
233430	,--	아이샤 웨스턴 건레이디 재킷(파랑)
233440	,--	아이샤 웨스턴 건레이디 팬츠(갈색)
233450	,--	아이샤 웨스턴 건레이디 장갑(갈색)
233460	,--	아이샤 웨스턴 건레이디 롱부츠(갈색)
233470	,--	아이샤 웨스턴 건레이디 모자(갈색)
233480	,--	아이샤 웨스턴 아파치 스태프(와인)
233490	,--	아이샤 웨스턴 건레이디 재킷(와인)
233500	,--	아이샤 웨스턴 건레이디 팬츠(하양)
233510	,--	아이샤 웨스턴 건레이디 장갑(하양)
233520	,--	아이샤 웨스턴 건레이디 롱부츠(연갈)
233530	,--	아이샤 웨스턴 건레이디 모자(와인)
233540	,--	레나 웨스턴 아파치 보우(갈색)
233550	,--	레나 웨스턴 카우걸 반다나 재킷(갈색)
233560	,--	레나 웨스턴 카우걸 숏스커트(갈색)
233570	,--	레나 웨스턴 카우걸 장갑(갈색)
233580	,--	레나 웨스턴 카우걸 숏부츠(갈색)
233590	,--	레나 웨스턴 카우걸 모자(갈색)
233600	,--	레나 웨스턴 아파치 보우(와인)
233610	,--	레나 웨스턴 카우걸 오픈 재킷(와인)
233620	,--	레나 웨스턴 카우걸 숏스커트(와인)
233630	,--	레나 웨스턴 카우걸 장갑(와인)
233640	,--	레나 웨스턴 카우걸 숏부츠(와인)
233650	,--	레나 웨스턴 카우걸 모자(와인)
233660	,--	레이븐 웨스턴 아파치 스피어(연갈)
233670	,--	레이븐 웨스턴 무법자 롱재킷(연갈)
233680	,--	레이븐 웨스턴 무법자 가죽 바지(회색)
233690	,--	레이븐 웨스턴 무법자 장갑(연갈)
233700	,--	레이븐 웨스턴 무법자 숏부츠(연갈)
233710	,--	레이븐 웨스턴 무법자 모자(고동)
233720	,--	레이븐 웨스턴 아파치 스피어(와인)
233730	,--	레이븐 웨스턴 무법자 롱재킷(와인)
233740	,--	레이븐 웨스턴 무법자 가죽 바지(고동)
233750	,--	레이븐 웨스턴 무법자 장갑(와인)
233760	,--	레이븐 웨스턴 무법자 숏부츠(와인)
233770	,--	레이븐 웨스턴 무법자 모자(와인)
233780	,--	이브 웨스턴 큐티홀스 기어(군청)
233790	,--	이브 웨스턴 쉐리프 블라우스(군청)
233800	,--	이브 웨스턴 쉐리프 진스커트(군청)
233810	,--	이브 웨스턴 쉐리프 장갑(군청)
233820	,--	이브 웨스턴 쉐리프 롱부츠(군청)
233830	,--	이브 웨스턴 쉐리프 롤링펌 헤어(검정)
233840	,--	이브 웨스턴 큐티홀스 기어(분홍)
233850	,--	이브 웨스턴 쉐리프 블라우스(고동)
233860	,--	이브 웨스턴 쉐리프 진스커트(하양)
233870	,--	이브 웨스턴 쉐리프 장갑(분홍)
233880	,--	이브 웨스턴 쉐리프 롱부츠(하양)
233890	,--	이브 웨스턴 쉐리프 롤링펌 헤어(하양)
233900	,--	청 웨스턴 카우보이 치프캐논(연갈)
233910	,--	청 웨스턴 카우보이 오픈 재킷(연갈)
233920	,--	청 웨스턴 카우보이 롱팬츠(연갈)
233930	,--	청 웨스턴 카우보이 장갑(연갈)
233940	,--	청 웨스턴 카우보이 숏부츠(연갈)
233950	,--	청 웨스턴 카우보이 모자(연갈)
233960	,--	청 웨스턴 카우보이 치프캐논(와인)
233970	,--	청 웨스턴 카우보이 오픈 재킷(와인)
233980	,--	청 웨스턴 카우보이 롱팬츠(와인)
233990	,--	청 웨스턴 카우보이 장갑(와인)
234000	,--	청 웨스턴 카우보이 숏부츠(와인)
234010	,--	청 웨스턴 카우보이 모자(와인)



250000430	,--	독일 디자인 컨테스트 「Thomas Rensen」 청 철포 (Ver.A)
250000431	,--	독일 디자인 컨테스트 「Thomas Rensen」 청 상의 (Ver.A)
250000432	,--	독일 디자인 컨테스트 「Thomas Rensen」 청 하의 (Ver.A)
250000433	,--	독일 디자인 컨테스트 「Thomas Rensen」 청 장갑 (Ver.A)
250000434	,--	독일 디자인 컨테스트 「Thomas Rensen」 청 신발 (Ver.A)
250000435	,--	독일 디자인 컨테스트 「Thomas Rensen」 청 헤어 (Ver.A)
250000440	,--	독일 디자인 컨테스트 「Thomas Rensen」 청 철포 (Ver.B)
250000441	,--	독일 디자인 컨테스트 「Thomas Rensen」 청 상의 (Ver.B)
250000442	,--	독일 디자인 컨테스트 「Thomas Rensen」 청 하의 (Ver.B)
250000443	,--	독일 디자인 컨테스트 「Thomas Rensen」 청 장갑 (Ver.B)
250000444	,--	독일 디자인 컨테스트 「Thomas Rensen」 청 신발 (Ver.B)
250000445	,--	독일 디자인 컨테스트 「Thomas Rensen」 청 헤어 (Ver.B)

	
--액세서리	
237240	,--	머리 위의 고양이(코숏)
237250	,--	머리 위의 고양이(터키쉬)
237260	,--	머리 위의 고양이(샴)
237270	,--	머리 위의 고양이(봄베이)

244610	,--	홍조(뿌잉뿌잉)
244620	,--	홍조(새침)
180001	,--	두근두근 하트 안경

133345	,--	드림 스텝 - 윈드
251740	,--	블루 엔젤 귀요미 날개
251750	,--	핑크 엔젤 귀요미 날개

233250	,--	웨스턴 건맨 미니미
233260	,--	웨스턴 건맨 라이플
233270	,--	웨스턴 건맨 다이너마이트 키트



250000200	,--	롭이어 토끼 꼬리 (하양)
250000201	,--	롭이어 토끼 꼬리 (살색)
130716	,--	투지의 암 가드
131284	,--	맹세의 완장
		
133346	,--	드림 스텝 - 스타
181467	,--	러블리 락앤롤 기타
251720	,--	화이트 락앤롤 기타 
251730	,--	블랙 락앤롤 기타 
		
180151	,--	애완용 쁘띠뽀루
180295	,--	뽀루 망토
		
60003456	,--	당근당근
233280	,--	재미있는 당근 놀이

	
244600	,--	다크서클
244630	,--	가슴을 적시는 눈물
500400	,--	조디악-파이시즈(물고기 자리)

207490	,--	앙증맞은 사슴 귀
243310	,--	드림 스텝 - 눈꽃
500390	,--	조디악-아쿠아리우스(물병 자리)
250000036	,--	겨울 스포츠 스켈레톤 (파랑)
250000046	,--	겨울 스포츠 스켈레톤 (검정)

500500	,--	조디악-캐프리코너스(염소 자리)
205970	,--	따뜻한 머플러
205990	,--	스타 스키 마스크
206000	,--	스노우 보드
243320	,--	스노우 크리스탈 씰

120002820	,--	황룡승천포
120002830	,--	흑룡천익
120002831	,--	흑룡우미
120002832	,--	흑룡성각

208170,--미스틸 언밸런스 에드온 가드 (엘소드)		
208180,--미스틸 폴 트위스트 핀 (아이샤)		
208190,--미스틸 그립 프로텍터 (레나)		
208200,--미스틸 풀러 러그스 (레이븐)		
208210,--미스틸 엔젤 링 (이브)		
229310	,--	미스틸 암 서포트 (청)
213510,--나소드 판넬 가드 (엘소드)		
213520,--나소드 판넬 가드 (아이샤)		
213530,--나소드 판넬 가드 (레나)		
213540,--나소드 판넬 가드 (레이븐)		
213550,--나소드 판넬 가드 (이브)	
229300	,--	나소드 판넬 가드 (청)

			
--소비		
90000413	,--	아리엘의 메리 메이커

210570,--얼음 조각상 가열기 10+3 큐브		
210560,--얼음 조각상 가열기 5+1 큐브		
210550,--얼음 조각상 가열기 1+1 큐브	
207500,--얼음조각상가열기

206770	,--	플루오르 스톤 Lv.5
206920	,--	축복받은 복원의 주문서 Lv.5
206760,--플루오르 스톤 Lv.4		
206910,--축복받은 복원의 주문서 Lv.4		
206750,--플루오르 스톤 Lv.3		
206900,--축복받은 복원의 주문서 Lv.3		
127030,--부활석		
	
--설치		
244560	,--	퀵슬롯 확장권
65000701	,--	루리엘의 신용 보증서
		
200885,--스킬 슬롯 체인지 메달		
206830,--캐릭터 슬롯 확장권 2개		
213610,--코보 은행 전체 확장 		
200751,--장비 인벤토리 확장 		
200752,--액세서리 인벤토리 확장 		
200756,--특수 인벤토리 확장 		
200753,--소비 인벤토리 확장 		
200754,--제조 인벤토리 확장 		
200755,--퀘스트 인벤토리 확장 		
200880,--스킬 슬롯 체인지 메달		
206820,--캐릭터 슬롯 확장권 2개		

--패키지
234020	,--	엘소드 웨스턴 건맨 패키지(고동)
234040	,--	아이샤 웨스턴 건레이디 패키지(갈색)
234060	,--	레나 웨스턴 카우걸 패키지(갈색)
234080	,--	레이븐 웨스턴 무법자 패키지(연갈)
234100	,--	이브 웨스턴 쉐리프 패키지(군청)
234120	,--	청 웨스턴 카우보이 패키지(연갈)
234030	,--	엘소드 웨스턴 건맨 패키지(와인)
234050	,--	아이샤 웨스턴 건레이디 패키지(와인)
234070	,--	레나 웨스턴 카우걸 패키지(와인)
234090	,--	레이븐 웨스턴 무법자 패키지(와인)
234110	,--	이브 웨스턴 쉐리프 패키지(분홍)
234130	,--	청 웨스턴 카우보이 패키지(와인)
		
250000020	,--	청 웨딩 아바타 패키지(하양)
250000021	,--	청 웨딩 아바타 패키지(검정)
		
235930	,--	엘소드 샤니베어 파자마 패키지(하늘)
235950	,--	아이샤 러블리 캣 파자마 패키지(분홍)
235970	,--	레나 나이트블룸 파자마 패키지(검정)
235990	,--	레이븐 하쉬드림 가운 패키지(하양)
236010	,--	이브 퓨어나잇 파자마 패키지(하양)
236030	,--	청 래핑카우 파자마 패키지(하양)
235940	,--	엘소드 샤니베어 파자마 패키지(주황)
235960	,--	아이샤 러블리 캣 파자마 패키지(보라)
235980	,--	레나 나이트블룸 파자마 패키지(분홍)
236000	,--	레이븐 하쉬드림 가운 패키지(주황)
236020	,--	이브 퓨어나잇 파자마 패키지(하늘)
236040	,--	청 래핑카우 파자마 패키지(노랑)



250000500	,--	독일 디자인 컨테스트 「Thomas Rensen」 청 패키지 (Ver.A)
250000501	,--	독일 디자인 컨테스트 「Thomas Rensen」 청 패키지 (Ver.B)
	

--이 아래로는 고정입니다 바꾸지 않으셔도 되요
--기본 아바타 로테이션 1
85001150	,--	엘소드 와일드 트레져 유니폼 패키지 (검정)
85001152	,--	아이샤 큐티 위치 드레스 패키지 (파랑)
85001154	,--	레나 포레스트 레인저 유니폼 패키지 (하양)
85001156	,--	레이븐 택티컬 캐쥬얼 패키지 (초록)
85001158	,--	이브 큐티 프레피 룩 패키지 (빨강)
85001160	,--	청 해양소년단제복 패키지 (파랑)
85001151	,--	엘소드 와일드 트레져 유니폼 패키지 (파랑)
85001153	,--	아이샤 큐티 위치 드레스 패키지 (자주)
85001155	,--	레나 포레스트 레인저 유니폼 패키지 (빨강)
85001157	,--	레이븐 택티컬 캐쥬얼 패키 (빨강)
85001159	,--	이브 큐티 프레피 룩 패키지 (청록)
85001161	,--	청 해양소년단제복 패키지 (분홍)

--기본 아바타 로테이션2
85001170	,--	엘소드 라이온하트 댄디룩 패키지 (주황)
85001172	,--	아이샤 그레이스 레이디 패키지 (빨강)
85001174	,--	레나 엘핀 캐쥬얼 수트 패키지 (하양)
85001176	,--	레이븐 킹덤 나이츠 패키지 (파랑)
85001178	,--	이브 와일드 트래커 패키지 (빨강)
85001180	,--	청 댄디크로스버클 패키지 (갈색)
85001171	,--	엘소드 라이온하트 댄디룩 패키지 (파랑)
85001173	,--	아이샤 그레이스 레이디 패키지 (파랑)
85001175	,--	레나 엘핀 캐쥬얼 수트 패키지 (청록)
85001177	,--	레이븐 킹덤 나이츠 패키지 (회색)
85001179	,--	이브 와일드 트래커 패키지 (파랑)
85001181	,--	청 댄디크로스버클 패키지 (하늘)

--기본 아바타 로테이션3
85001200	,--	엘소드 로열 가드 유니폼 패키지 (노랑)
85001210	,--	아이샤 미라지 레더 아머 패키지 (보라)
85001220	,--	레나 발키리 컴뱃 아머 패키지 (빨강)
85001230	,--	레이브 오컬트 체인 아이 패키지 (검정)
85001240	,--	이브 스타 스포티 룩 패키지 (빨강)
85001250	,--	청 세인트크로스가더 패키지 (보라)
85001201	,--	엘소드 로열 가드 유니폼 패키지 (회색)
85001211	,--	아이샤 미라지 레더 아머 패키지 (고동)
85001221	,--	레나 발키리 컴뱃 아머 패키지 (파랑)
85001231	,--	레이븐 오컬트 체인 아이 패키지 (하양)
85001241	,--	이브 스타 스포티 룩 패키지 (파랑)
85001251	,--	청 세인트크로스가더 패키지 (분홍)

--기본 아바타 로테이션4
85001260	,--	엘소드 패닝커트 유니폼 패키지 (파랑)
85001270	,--	아이샤 앨리스 유니폼 패키지 (파랑)
85001280	,--	레나 벨스타 헌터 패키지 (청록)
85001290	,--	레이븐 패딩 플레이트 아머 패키지 (빨강)
85001300	,--	이브 성 비비안 여학원 제복 패키지 (자주색)
85001310	,--	청 로열캐너니어 패키지 (파랑)
85001261	,--	엘소드 패닝커트 유니폼 패키지 (빨강)
85001271	,--	아이샤 앨리스 유니폼 패키지 (빨강)
85001281	,--	레나 벨스타 헌터 패키지 (고동)
85001291	,--	레이븐 패딩 플레이트 아머 패키지 (파랑)
85001301	,--	이브 성 비비안 여학원 제복 패키지 (회갈색)
85001311	,--	청 로열캐너니어 패키지 (하늘)

--기본 아바타 로테이션5
85001320	,--	엘소드 리틀 나이츠 패키지 (빨강)
85001330	,--	아이샤 프리티 위치 패키지 (파랑)
85001340	,--	레나 버클릭 밸리 패키지 (검정)
85001350	,--	레이븐 라이트 아미 패키지 (빨강)
85001360	,--	이브 키티 롤리타 드레스 패키지 (검정)
85001370	,--	청 에어기어룩 패키지 (파랑)
85001321	,--	엘소드 리틀 나이츠 패키지 (노랑)
85001331	,--	아이샤 프리티 위치 패키지 (보라)
85001341	,--	레나 버클릭 밸리 패키지 (빨강)
85001351	,--	레이븐 라이트 아미 패키지 (녹색)
85001361	,--	이브 키티 롤리타 드레스 패키지 (보라)
85001371	,--	청 에어기어룩 패키지 (빨강)


--기본 아바타 로테이션6
85001380	,--	엘소드 웨스턴 키드 패키지 (고동)
85001390	,--	아이샤 큐티 스쿨룩 패키지 (고동)
85001400	,--	레나 S라인 드레스 패키지 (하양)
85001410	,--	레이븐 웨스턴 터프가이 패키지 (고동)
85001420	,--	청 고스트헌터 패키지 (빨강)
85001381	,--	엘소드 웨스턴 키드 패키지 (빨강)
85001391	,--	아이샤 큐티 스쿨룩 패키지 (청록)
85001401	,--	레나 S라인 드레스 패키지 (다홍)
85001411	,--	레이븐 웨스턴 터프가이 패키지 (빨강)
85001421	,--	청 고스트헌터 패키지 (파랑)

--기본 아바타 로테이션7
85001430	,--	엘소드 혼 스파이크 패키지 (고동)
85001440	,--	아이샤 큐티 리본 패키지 (분홍)
85001450	,--	레나 럭셔리 헌터슈트 패키지 (하양)
85001460	,--	레이븐 철의 용병 패키지 (검정)
85001431	,--	엘소드 혼 스파이크 패키지 (하양)
85001441	,--	아이샤 큐티 리본 패키지 (노랑)
85001451	,--	레나 럭셔리 헌터슈트 패키지 (검정)
85001461	,--	레이븐 철의 용병 패키지 (초록)

--기본 아바타 로테이션8
85001470	,--	엘소드 크로스 버클 패키지 (빨강)
85001480	,--	아이샤 스컬 츄리닝 패키지 (보라)
85001490	,--	레나 체크 헌터 패키지 (빨강)
85001471	,--	엘소드 크로스 버클 패키지 (파랑)
85001481	,--	아이샤 스컬 츄리닝 패키지 (하양)
85001491	,--	레나 체크 헌터 패키지 (하양)

--기본 아바타 로테이션9
85001470	,--	엘소드 크로스 버클 패키지 (빨강)
85001480	,--	아이샤 스컬 츄리닝 패키지 (보라)
85001490	,--	레나 체크 헌터 패키지 (빨강)
85001471	,--	엘소드 크로스 버클 패키지 (파랑)
85001481	,--	아이샤 스컬 츄리닝 패키지 (하양)
85001491	,--	레나 체크 헌터 패키지 (하양)


--로테이션 영구판매1
211180	,--	밀리터리 룩 엘소드 패키지(암회색)
211200	,--	밀리터리 룩 아이샤 패키지(녹회색)
211220	,--	밀리터리 룩 레나 패키지(연노랑)
211240	,--	밀리터리 룩 레이븐 패키지(회갈색)
211260	,--	밀리터리 룩 이브 패키지(남색)
211190	,--	밀리터리 룩 엘소드 패키지(은백색)
211210	,--	밀리터리 룩 아이샤 패키지(회자색)
211230	,--	밀리터리 룩 레나 패키지(파랑)
211250	,--	밀리터리 룩 레이븐 패키지(녹회색)
211270	,--	밀리터리 룩 이브 패키지(흑갈색)

--로테이션 영구판매2
208920	,--	엘소드 스타 아카데미 패키지(감청)
208940	,--	아이샤 스타 아카데미 패키지(감청)
208960	,--	레나 스타 아카데미 패키지(감청)
208980	,--	레이븐 스타 아카데미 패키지(감청)
209000	,--	이브 스타 아카데미 패키지(감청)
208930	,--	엘소드 스타 아카데미 패키지(하양)
208950	,--	아이샤 스타 아카데미 패키지(하양)
208970	,--	레나 스타 아카데미 패키지(하양)
208990	,--	레이븐 스타 아카데미 패키지(하양)
209010	,--	이브 스타 아카데미 패키지(하양)

--로테이션 영구판매3
217040	,--	엘소드 천하일통 장수 패키지 (빨강)
217060	,--	아이샤 천하일통 장수 패키지 (보라)
217080	,--	레나 천하일통 장수 패키지 (분홍)
217100	,--	레이븐 천하일통 장수 패키지 (파랑)
217120	,--	이브 천하일통 장수 패키지 (검정)
217050	,--	엘소드 천하일통 장수 패키지 (파랑)
217070	,--	아이샤 천하일통 장수 패키지 (녹색)
217090	,--	레나 천하일통 장수 패키지 (연두)
217110	,--	레이븐 천하일통 장수 패키지 (빨강)
217130	,--	이브 천하일통 장수 패키지 (하양)

--유럽 로테이션
115000060	,--	엘소드 유카타 패키지(빨강)
115000062	,--	아이샤 유카타 패키지(자주)
115000064	,--	레나 유카타 패키지(하늘)
115000066	,--	레이븐 유카타 패키지(파랑)
115000068	,--	이브 유카타 패키지(분홍)
115000061	,--	엘소드 유카타 패키지(하양)
115000063	,--	아이샤 유카타 패키지(분홍)
115000065	,--	레나 유카타 패키지(자주)
115000067	,--	레이븐 유카타 패키지(고동)
115000069	,--	이브 유카타 패키지(노랑)

210270	,--	아이돌 밴드 엘소드 패키지(분홍)
210290	,--	아이돌 밴드 아이샤 패키지(분홍)
210310	,--	파워풀 디바 레나 패키지(하양)
210330	,--	월드스타 레이븐 패키지(회색)
210350	,--	프린세스 아이돌 이브 패키지(분홍)
85001580	,--	아이돌 밴드 청 패키지(노랑)
210280	,--	아이돌 밴드 엘소드 패키지(연두)
210300	,--	아이돌 밴드 아이샤 패키지(노랑)
210320	,--	파워풀 디바 레나 패키지(노랑)
210340	,--	월드스타 레이븐 패키지(노랑)
210360	,--	프린세스 아이돌 이브 패키지(연두)
85001581	,--	아이돌 밴드 청 패키지(연두)

212970	,--	엘소드 해적 코스프레 패키지(빨강)
212990	,--	아이샤 해적 코스프레 패키지(파랑)
213010	,--	레나 해적 코스프레 패키지(청록)
213030	,--	레이븐 해적 코스프레 패키지(검정)
213050	,--	이브 해적 코스프레 패키지(고동)
90001392	,--	청 해적 코스프레 패키지(검정)
212980	,--	엘소드 해적 코스프레 패키지(노랑)
213000	,--	아이샤 해적 코스프레 패키지(검정)
213020	,--	레나 해적 코스프레 패키지(자두)
213040	,--	레이븐 해적 코스프레 패키지(하양)
213060	,--	이브 해적 코스프레 패키지(파랑)
90001393	,--	청 해적 코스프레 패키지(빨강)

115000220	,--	엘소드 유저 디자인 아바타(TR) 패키지(1p)
115000222	,--	아이샤 유저 디자인 아바타(TR) 패키지(1p)
115000224	,--	레나 유저 디자인 아바타(TR) 패키지(1p)
115000226	,--	레이븐 유저 디자인 아바타(TR) 패키지(1p)
115000228	,--	이브 유저 디자인 아바타(TR) 패키지(1p)
115000221	,--	엘소드 유저 디자인 아바타(TR) 패키지(2p)
115000223	,--	아이샤 유저 디자인 아바타(TR) 패키지(2p)
115000225	,--	레나 유저 디자인 아바타(TR) 패키지(2p)
115000227	,--	레이븐 유저 디자인 아바타(TR) 패키지(2p)
115000229	,--	이브 유저 디자인 아바타(TR) 패키지(2p)

218590	,--	엘소드 호랑이 코스프레  패키지 (빨강)
218610	,--	아이샤 고양이 코스프레  패키지 (빨강)
218630	,--	레나 여우 코스프레  패키지 (노랑)
218650	,--	레이븐 늑대 코스프레  패키지 (빨강)
218670	,--	이브 양 코스프레  패키지 (회갈색)
218600	,--	엘소드 호랑이 코스프레  패키지 (파랑)
218620	,--	아이샤 고양이 코스프레  패키지 (보라)
218640	,--	레나 여우 코스프레  패키지 (회색)
218660	,--	레이븐 늑대 코스프레  패키지 (파랑)
218680	,--	이브 양 코스프레  패키지 (검정)

204770	,--	사대부가 도령 한복 패키지 (파랑)
204790	,--	소녀 당의 한복 패키지 (하양)
204810	,--	황진 장미단 한복 패키지 (빨강)
204830	,--	방랑협객 두루마기 의관 패키지 (하양)
207510	,--	화양비단 궁중 당의 패키지(검정)
204780	,--	사대부가 도령 한복 패키지 (빨강)
204800	,--	소녀 당의 한복 패키지 (노랑)
204820	,--	황진 장미단 한복 패키지 (초록)
204840	,--	방랑협객 두루마기 의관 패키지 (파랑)
207520	,--	화양비단 궁중 당의 패키지(분홍)

212240	,--	엘소드 체커 썸머룩 패키지(파랑)
212260	,--	아이샤 리보닉 썸머룩 패키지(초록)
212280	,--	레나 엘핀 체커 썸머룩 패키지(파랑)
212300	,--	레이븐 체커 플라워 비치룩 패키지(한색)
212320	,--	이브 스쿨 스윔슈트 패키지(분홍)
85001142	,--	청 체커 사선 비치룩 패키지 (파랑)
212250	,--	엘소드 체커 썸머룩 패키지(빨강)
212270	,--	아이샤 리보닉 썸머룩 패키지(파랑)
212290	,--	레나 엘핀 체커 썸머룩 패키지(빨강)
212310	,--	레이븐 체커 플라워 비치룩 패키지(온색)
212330	,--	이브 스쿨 스윔슈트 패키지(검정)
85001143	,--	청 체커 사선 비치룩 패키지 (빨강)

120002980	,--	엘소드 판타지 절마사 패키지(빨강)
120002982	,--	아이샤 판타지 마봉술사 패키지(와인)
120002984	,--	레나 판타지 이블 헌터 패키지(남청)
120002986	,--	레이븐 판타지 뱀파이어 헌터 패키지(검정)
120002988	,--	이브 판타지 시스터 패키지(검정)
120002981	,--	엘소드 판타지 절마사 패키지(초록)
120002983	,--	아이샤 판타지 마봉술사 패키지(연녹)
120002985	,--	레나 판타지 이블 헌터 패키지(주황)
120002987	,--	레이븐 판타지 뱀파이어 헌터 패키지(하양)
120002989	,--	이브 판타지 시스터 패키지(하양)

115000290	,--	엘소드 유저 아바타 2차 콘테스트 패키지(2p)
115000292	,--	아이샤 유저 아바타 2차 콘테스트 패키지(1p)
115000294	,--	레나 유저 아바타 2차 콘테스트 패키지(1p)
115000296	,--	레이븐 유저 아바타 2차 콘테스트 패키지(1p)
115000298	,--	이브 유저 아바타 2차 콘테스트 패키지(1p)
115000291	,--	엘소드 유저 아바타 2차 콘테스트 패키지(1p)
115000293	,--	아이샤 유저 아바타 2차 콘테스트 패키지(2p)
115000295	,--	레나 유저 아바타 2차 콘테스트 패키지(2p)
115000297	,--	레이븐 유저 아바타 2차 콘테스트 패키지(2p)
115000299	,--	이브 유저 아바타 2차 콘테스트 패키지(2p)

222210	,--	엘소드 테니스 세트(파랑)
222230	,--	아이샤 테니스 세트(하양)
222250	,--	레나 테니스 세트(노랑)
222270	,--	레이븐 테니스 세트(하양)
222290	,--	이브 테니스 세트(노랑)
85001070	,--	청 테니스 세트(청록)
222220	,--	엘소드 테니스 세트(노랑)
222240	,--	아이샤 테니스 세트(검정)
222260	,--	레나 테니스 세트(검정)
222280	,--	레이븐 테니스 세트(검정)
222300	,--	이브 테니스 세트(분홍)
85001071	,--	청 테니스 세트(연두)

221430	,--	엘소드 5월의 웨딩 패키지(하양)
221450	,--	아이샤 5월의 웨딩 패키지(하양)
221470	,--	레나 5월의 웨딩 패키지(연노랑)
221490	,--	레이븐 5월의 웨딩 패키지(하양)
221510	,--	이브 5월의 웨딩 패키지(하양)
221440	,--	엘소드 5월의 웨딩 패키지(검정)
221460	,--	아이샤 5월의 웨딩 패키지(검정)
221480	,--	레나 5월의 웨딩 패키지(검정)
221500	,--	레이븐 5월의 웨딩 패키지(검정)
221520	,--	이브 5월의 웨딩 패키지(검정)

208220	,--	엘소드의 국선 화랑 의복 패키지(빨강)
208240	,--	아이샤의 단저고리 양단 개량 한복 패키지(주황)
208260	,--	레나의 장저고리 양단 개량 한복 패키지(빨강)
208280	,--	레이븐의 좌포청 포도대장 관복 패키지(빨강)
208300	,--	이브의 난초화 극장저고리 한복 패키지(초록)
208230	,--	엘소드의 선랑 화랑 의복 패키지(파랑)
208250	,--	아이샤의 단저고리 양단 개량 한복 패키지(빨강)
208270	,--	레나의 장저고리 양단 개량 한복 패키지(검정)
208290	,--	레이븐의 우포청 포도대장 관복 패키지(파랑)
208310	,--	이브의 난초화 극장저고리 한복 패키지(보라)

214270	,--	엘소드 썸머 캐쥬얼 패키지(검정)
214290	,--	아이샤 썸머 캐쥬얼 패키지(검정)
214310	,--	레나 썸머 캐쥬얼 패키지(검정)
214330	,--	레이븐 썸머 캐쥬얼 패키지(하양)
214350	,--	이브 썸머 캐쥬얼 패키지(검정)
85001122	,--	청 썸머 캐쥬얼 패키지(빨강)
214280	,--	엘소드 썸머 캐쥬얼 패키지(하늘)
214300	,--	아이샤 썸머 캐쥬얼 패키지(하양)
214320	,--	레나 썸머 캐쥬얼 패키지(노랑)
214340	,--	레이븐 썸머 캐쥬얼 패키지(노랑)
214360	,--	이브 썸머 캐쥬얼 패키지(하양)
85001123	,--	청 썸머 캐쥬얼 패키지(초록)

219870	,--	엘소드 겨울 스포츠 스키점프 패키지 (보라)
219890	,--	아이샤 겨울 스포츠 스노우보드 패키지 (보라)
219910	,--	레나 겨울 스포츠 스피드 스케이팅 패키지 (파랑)
219930	,--	레이븐 겨울 스포츠 아이스 하키 패키지 (파랑)
219950	,--	이브 겨울 스포츠 피겨 스케이팅 패키지 (파랑)
250000050	,--	청 겨울 스포츠 봅슬레이 패키지 (파랑)
219880	,--	엘소드 겨울 스포츠 스키점프 패키지 (빨강)
219900	,--	아이샤 겨울 스포츠 스노우보드 패키지 (분홍)
219920	,--	레나 겨울 스포츠 스피드 스케이팅 패키지 (보라)
219940	,--	레이븐 겨울 스포츠 아이스 하키 패키지 (주황)
219960	,--	이브 겨울 스포츠 피겨 스케이팅 패키지 (빨강)
250000051	,--	청 겨울 스포츠 봅슬레이 패키지 (검정)

217750	,--	엘소드 윈터 캐쥬얼 패키지 (빨강)
217770	,--	아이샤 윈터 캐쥬얼 패키지 (분홍)
217790	,--	레나 윈터 캐쥬얼 패키지 (노랑)
217810	,--	레이븐 윈터 캐쥬얼 패키지 (파랑)
217830	,--	이브 윈터 캐쥬얼 패키지 (빨강)
217760	,--	엘소드 윈터 캐쥬얼 패키지 (파랑)
217780	,--	아이샤 윈터 캐쥬얼 패키지 (회보라)
217800	,--	레나 윈터 캐쥬얼 패키지 (분홍)
217820	,--	레이븐 윈터 캐쥬얼 패키지 (적갈색)
217840	,--	이브 윈터 캐쥬얼 패키지 (노랑)

206630	,--	엘소드의 크리스마스 패키지(빨강)
206650	,--	아이샤의 크리스마스 패키지(빨강)
206670	,--	레나의 크리스마스 패키지(빨강)
206690	,--	레이븐의 크리스마스 패키지(빨강)
206710	,--	이브의 크리스마스 패키지(빨강)
259280	,--	청의 크리스마스 패키지(빨강)
206640	,--	엘소드의 크리스마스 패키지(검정)
206660	,--	아이샤의 크리스마스 패키지(검정)
206680	,--	레나의 크리스마스 패키지(검정)
206700	,--	레이븐의 크리스마스 패키지(검정)
206720	,--	이브의 크리스마스 패키지(검정)
259290	,--	청의 크리스마스 패키지(검정)

205850	,--	엘소드의 할로윈 의상 패키지(빨강)
205860	,--	엘소드의 할로윈 의상 패키지(청록)
205870	,--	아이샤의 할로윈 의상 패키지(주황)
205880	,--	아이샤의 할로윈 의상 패키지(빨강)
205890	,--	레나의 할로윈 의상 패키지(보라)
205900	,--	레나의 할로윈 의상 패키지(분홍)
205910	,--	레이븐의 할로윈 의상 패키지(파랑)
205920	,--	레이븐의 할로윈 의상 패키지(빨강)
115000080	,--	이브의 할로윈 의상 패키지(분홍)
115000090	,--	이브의 할로윈 의상 패키지(파랑)

211950	,--	엘소드 스타 아카데미 하복 하복 패키지(감청)
211970	,--	아이샤 스타 아카데미 하복 패키지(감청)
211990	,--	레나 스타 아카데미 하복 패키지(감청)
212010	,--	레이븐 스타 아카데미 하복 패키지(감청)
212030	,--	이브 스타 아카데미 하복 패키지(감청)
85001190	,--	청 스타 아카데미 하복 패키지(감청)
211960	,--	엘소드 스타 아카데미 하복 패키지(갈색)
211980	,--	아이샤 스타 아카데미 하복 패키지(갈색)
212000	,--	레나 스타 아카데미 하복 패키지(갈색)
212020	,--	레이븐 스타 아카데미 하복 패키지(갈색)
212040	,--	이브 스타 아카데미 하복 패키지(갈색)
85001191	,--	청 스타 아카데미 하복 패키지(갈색)

229180	,--	엘소드 2010 크리스마스 패키지(빨강)
229200	,--	아이샤 2010 크리스마스 패키지(빨강)
229220	,--	레나 2010 크리스마스 패키지(빨강)
229240	,--	레이븐 2010 크리스마스 패키지(빨강)
229260	,--	이브 2010 크리스마스 패키지(빨강)
229280	,--	청 2010 크리스마스 패키지(빨강)
229190	,--	엘소드 2010 크리스마스 패키지(보라)
229210	,--	아이샤 2010 크리스마스 패키지(보라)
229230	,--	레나 2010 크리스마스 패키지(보라)
229250	,--	레이븐 2010 크리스마스 패키지(보라)
229270	,--	이브 2010 크리스마스 패키지(보라)
229290	,--	청 2010 크리스마스 패키지(보라)

228260	,--	엘소드 타탄체크 의상 패키지(빨강)
228280	,--	아이샤 타탄체크 의상 패키지(자주)
228300	,--	레나 타탄체크 의상 패키지(자주)
228320	,--	레이븐 타탄체크 의상 패키지(빨강)
228340	,--	이브 타탄체크 의상 패키지(자주)
70002860	,--	청 타탄체크 의상 큐브(청록)
228270	,--	엘소드 타탄체크 의상 패키지(청록)
228290	,--	아이샤 타탄체크 의상 패키지(고동)
228310	,--	레나 타탄체크 의상 패키지(고동)
228330	,--	레이븐 타탄체크 의상 패키지(청록)
228350	,--	이브 타탄체크 의상 패키지(고동)
70002861	,--	청 타탄체크 의상 큐브(빨강)

227530	,--	배드 가이즈 엘소드 패키지(갈색)
227550	,--	배드 가이즈 아이샤 패키지(분홍)
227570	,--	배드 가이즈 레나 패키지(분홍)
227590	,--	배드 가이즈 레이븐 패키지(분홍)
227610	,--	배드 가이즈 이브 패키지(분홍)
70002310	,--	배드 가이즈 청 패키지(분홍)
227540	,--	배드 가이즈 엘소드 패키지(하늘)
227560	,--	배드 가이즈 아이샤 패키지(하늘)
227580	,--	배드 가이즈 레나 패키지(하늘)
227600	,--	배드 가이즈 레이븐 패키지(하늘)
227620	,--	배드 가이즈 이브 패키지(하늘)
70002311	,--	배드 가이즈 청 패키지(하늘)
}		
		
RECOMMEND_ITEM =		
		
{
234020	,--	엘소드 웨스턴 건맨 패키지(고동)
234040	,--	아이샤 웨스턴 건레이디 패키지(갈색)
234060	,--	레나 웨스턴 카우걸 패키지(갈색)
234080	,--	레이븐 웨스턴 무법자 패키지(연갈)
234100	,--	이브 웨스턴 쉐리프 패키지(군청)
234120	,--	청 웨스턴 카우보이 패키지(연갈)
234030	,--	엘소드 웨스턴 건맨 패키지(와인)
234050	,--	아이샤 웨스턴 건레이디 패키지(와인)
234070	,--	레나 웨스턴 카우걸 패키지(와인)
234090	,--	레이븐 웨스턴 무법자 패키지(와인)
234110	,--	이브 웨스턴 쉐리프 패키지(분홍)
234130	,--	청 웨스턴 카우보이 패키지(와인)
		
250000020	,--	청 웨딩 아바타 패키지(하양)
250000021	,--	청 웨딩 아바타 패키지(검정)
		
235930	,--	엘소드 샤니베어 파자마 패키지(하늘)
235950	,--	아이샤 러블리 캣 파자마 패키지(분홍)
235970	,--	레나 나이트블룸 파자마 패키지(검정)
235990	,--	레이븐 하쉬드림 가운 패키지(하양)
236010	,--	이브 퓨어나잇 파자마 패키지(하양)
236030	,--	청 래핑카우 파자마 패키지(하양)
235940	,--	엘소드 샤니베어 파자마 패키지(주황)
235960	,--	아이샤 러블리 캣 파자마 패키지(보라)
235980	,--	레나 나이트블룸 파자마 패키지(분홍)
236000	,--	레이븐 하쉬드림 가운 패키지(주황)
236020	,--	이브 퓨어나잇 파자마 패키지(하늘)
236040	,--	청 래핑카우 파자마 패키지(노랑)


	
250000500	,--	독일 디자인 컨테스트 「Thomas Rensen」 청 패키지 (Ver.A)
250000501	,--	독일 디자인 컨테스트 「Thomas Rensen」 청 패키지 (Ver.B)
		
--이 아래로는 고정입니다 바꾸지 않으셔도 되요
--기본 아바타 로테이션 1
85001150	,--	엘소드 와일드 트레져 유니폼 패키지 (검정)
85001152	,--	아이샤 큐티 위치 드레스 패키지 (파랑)
85001154	,--	레나 포레스트 레인저 유니폼 패키지 (하양)
85001156	,--	레이븐 택티컬 캐쥬얼 패키지 (초록)
85001158	,--	이브 큐티 프레피 룩 패키지 (빨강)
85001160	,--	청 해양소년단제복 패키지 (파랑)
85001151	,--	엘소드 와일드 트레져 유니폼 패키지 (파랑)
85001153	,--	아이샤 큐티 위치 드레스 패키지 (자주)
85001155	,--	레나 포레스트 레인저 유니폼 패키지 (빨강)
85001157	,--	레이븐 택티컬 캐쥬얼 패키 (빨강)
85001159	,--	이브 큐티 프레피 룩 패키지 (청록)
85001161	,--	청 해양소년단제복 패키지 (분홍)

--기본 아바타 로테이션2
85001170	,--	엘소드 라이온하트 댄디룩 패키지 (주황)
85001172	,--	아이샤 그레이스 레이디 패키지 (빨강)
85001174	,--	레나 엘핀 캐쥬얼 수트 패키지 (하양)
85001176	,--	레이븐 킹덤 나이츠 패키지 (파랑)
85001178	,--	이브 와일드 트래커 패키지 (빨강)
85001180	,--	청 댄디크로스버클 패키지 (갈색)
85001171	,--	엘소드 라이온하트 댄디룩 패키지 (파랑)
85001173	,--	아이샤 그레이스 레이디 패키지 (파랑)
85001175	,--	레나 엘핀 캐쥬얼 수트 패키지 (청록)
85001177	,--	레이븐 킹덤 나이츠 패키지 (회색)
85001179	,--	이브 와일드 트래커 패키지 (파랑)
85001181	,--	청 댄디크로스버클 패키지 (하늘)

--기본 아바타 로테이션3
85001200	,--	엘소드 로열 가드 유니폼 패키지 (노랑)
85001210	,--	아이샤 미라지 레더 아머 패키지 (보라)
85001220	,--	레나 발키리 컴뱃 아머 패키지 (빨강)
85001230	,--	레이브 오컬트 체인 아이 패키지 (검정)
85001240	,--	이브 스타 스포티 룩 패키지 (빨강)
85001250	,--	청 세인트크로스가더 패키지 (보라)
85001201	,--	엘소드 로열 가드 유니폼 패키지 (회색)
85001211	,--	아이샤 미라지 레더 아머 패키지 (고동)
85001221	,--	레나 발키리 컴뱃 아머 패키지 (파랑)
85001231	,--	레이븐 오컬트 체인 아이 패키지 (하양)
85001241	,--	이브 스타 스포티 룩 패키지 (파랑)
85001251	,--	청 세인트크로스가더 패키지 (분홍)

--기본 아바타 로테이션4
85001260	,--	엘소드 패닝커트 유니폼 패키지 (파랑)
85001270	,--	아이샤 앨리스 유니폼 패키지 (파랑)
85001280	,--	레나 벨스타 헌터 패키지 (청록)
85001290	,--	레이븐 패딩 플레이트 아머 패키지 (빨강)
85001300	,--	이브 성 비비안 여학원 제복 패키지 (자주색)
85001310	,--	청 로열캐너니어 패키지 (파랑)
85001261	,--	엘소드 패닝커트 유니폼 패키지 (빨강)
85001271	,--	아이샤 앨리스 유니폼 패키지 (빨강)
85001281	,--	레나 벨스타 헌터 패키지 (고동)
85001291	,--	레이븐 패딩 플레이트 아머 패키지 (파랑)
85001301	,--	이브 성 비비안 여학원 제복 패키지 (회갈색)
85001311	,--	청 로열캐너니어 패키지 (하늘)

--기본 아바타 로테이션5
85001320	,--	엘소드 리틀 나이츠 패키지 (빨강)
85001330	,--	아이샤 프리티 위치 패키지 (파랑)
85001340	,--	레나 버클릭 밸리 패키지 (검정)
85001350	,--	레이븐 라이트 아미 패키지 (빨강)
85001360	,--	이브 키티 롤리타 드레스 패키지 (검정)
85001370	,--	청 에어기어룩 패키지 (파랑)
85001321	,--	엘소드 리틀 나이츠 패키지 (노랑)
85001331	,--	아이샤 프리티 위치 패키지 (보라)
85001341	,--	레나 버클릭 밸리 패키지 (빨강)
85001351	,--	레이븐 라이트 아미 패키지 (녹색)
85001361	,--	이브 키티 롤리타 드레스 패키지 (보라)
85001371	,--	청 에어기어룩 패키지 (빨강)


--기본 아바타 로테이션6
85001380	,--	엘소드 웨스턴 키드 패키지 (고동)
85001390	,--	아이샤 큐티 스쿨룩 패키지 (고동)
85001400	,--	레나 S라인 드레스 패키지 (하양)
85001410	,--	레이븐 웨스턴 터프가이 패키지 (고동)
85001420	,--	청 고스트헌터 패키지 (빨강)
85001381	,--	엘소드 웨스턴 키드 패키지 (빨강)
85001391	,--	아이샤 큐티 스쿨룩 패키지 (청록)
85001401	,--	레나 S라인 드레스 패키지 (다홍)
85001411	,--	레이븐 웨스턴 터프가이 패키지 (빨강)
85001421	,--	청 고스트헌터 패키지 (파랑)

--기본 아바타 로테이션7
85001430	,--	엘소드 혼 스파이크 패키지 (고동)
85001440	,--	아이샤 큐티 리본 패키지 (분홍)
85001450	,--	레나 럭셔리 헌터슈트 패키지 (하양)
85001460	,--	레이븐 철의 용병 패키지 (검정)
85001431	,--	엘소드 혼 스파이크 패키지 (하양)
85001441	,--	아이샤 큐티 리본 패키지 (노랑)
85001451	,--	레나 럭셔리 헌터슈트 패키지 (검정)
85001461	,--	레이븐 철의 용병 패키지 (초록)

--기본 아바타 로테이션8
85001470	,--	엘소드 크로스 버클 패키지 (빨강)
85001480	,--	아이샤 스컬 츄리닝 패키지 (보라)
85001490	,--	레나 체크 헌터 패키지 (빨강)
85001471	,--	엘소드 크로스 버클 패키지 (파랑)
85001481	,--	아이샤 스컬 츄리닝 패키지 (하양)
85001491	,--	레나 체크 헌터 패키지 (하양)

--기본 아바타 로테이션9
85001470	,--	엘소드 크로스 버클 패키지 (빨강)
85001480	,--	아이샤 스컬 츄리닝 패키지 (보라)
85001490	,--	레나 체크 헌터 패키지 (빨강)
85001471	,--	엘소드 크로스 버클 패키지 (파랑)
85001481	,--	아이샤 스컬 츄리닝 패키지 (하양)
85001491	,--	레나 체크 헌터 패키지 (하양)


--로테이션 영구판매1
211180	,--	밀리터리 룩 엘소드 패키지(암회색)
211200	,--	밀리터리 룩 아이샤 패키지(녹회색)
211220	,--	밀리터리 룩 레나 패키지(연노랑)
211240	,--	밀리터리 룩 레이븐 패키지(회갈색)
211260	,--	밀리터리 룩 이브 패키지(남색)
211190	,--	밀리터리 룩 엘소드 패키지(은백색)
211210	,--	밀리터리 룩 아이샤 패키지(회자색)
211230	,--	밀리터리 룩 레나 패키지(파랑)
211250	,--	밀리터리 룩 레이븐 패키지(녹회색)
211270	,--	밀리터리 룩 이브 패키지(흑갈색)

--로테이션 영구판매2
208920	,--	엘소드 스타 아카데미 패키지(감청)
208940	,--	아이샤 스타 아카데미 패키지(감청)
208960	,--	레나 스타 아카데미 패키지(감청)
208980	,--	레이븐 스타 아카데미 패키지(감청)
209000	,--	이브 스타 아카데미 패키지(감청)
208930	,--	엘소드 스타 아카데미 패키지(하양)
208950	,--	아이샤 스타 아카데미 패키지(하양)
208970	,--	레나 스타 아카데미 패키지(하양)
208990	,--	레이븐 스타 아카데미 패키지(하양)
209010	,--	이브 스타 아카데미 패키지(하양)

--로테이션 영구판매3
217040	,--	엘소드 천하일통 장수 패키지 (빨강)
217060	,--	아이샤 천하일통 장수 패키지 (보라)
217080	,--	레나 천하일통 장수 패키지 (분홍)
217100	,--	레이븐 천하일통 장수 패키지 (파랑)
217120	,--	이브 천하일통 장수 패키지 (검정)
217050	,--	엘소드 천하일통 장수 패키지 (파랑)
217070	,--	아이샤 천하일통 장수 패키지 (녹색)
217090	,--	레나 천하일통 장수 패키지 (연두)
217110	,--	레이븐 천하일통 장수 패키지 (빨강)
217130	,--	이브 천하일통 장수 패키지 (하양)

--유럽 로테이션
115000060	,--	엘소드 유카타 패키지(빨강)
115000062	,--	아이샤 유카타 패키지(자주)
115000064	,--	레나 유카타 패키지(하늘)
115000066	,--	레이븐 유카타 패키지(파랑)
115000068	,--	이브 유카타 패키지(분홍)
115000061	,--	엘소드 유카타 패키지(하양)
115000063	,--	아이샤 유카타 패키지(분홍)
115000065	,--	레나 유카타 패키지(자주)
115000067	,--	레이븐 유카타 패키지(고동)
115000069	,--	이브 유카타 패키지(노랑)

210270	,--	아이돌 밴드 엘소드 패키지(분홍)
210290	,--	아이돌 밴드 아이샤 패키지(분홍)
210310	,--	파워풀 디바 레나 패키지(하양)
210330	,--	월드스타 레이븐 패키지(회색)
210350	,--	프린세스 아이돌 이브 패키지(분홍)
85001580	,--	아이돌 밴드 청 패키지(노랑)
210280	,--	아이돌 밴드 엘소드 패키지(연두)
210300	,--	아이돌 밴드 아이샤 패키지(노랑)
210320	,--	파워풀 디바 레나 패키지(노랑)
210340	,--	월드스타 레이븐 패키지(노랑)
210360	,--	프린세스 아이돌 이브 패키지(연두)
85001581	,--	아이돌 밴드 청 패키지(연두)

212970	,--	엘소드 해적 코스프레 패키지(빨강)
212990	,--	아이샤 해적 코스프레 패키지(파랑)
213010	,--	레나 해적 코스프레 패키지(청록)
213030	,--	레이븐 해적 코스프레 패키지(검정)
213050	,--	이브 해적 코스프레 패키지(고동)
90001392	,--	청 해적 코스프레 패키지(검정)
212980	,--	엘소드 해적 코스프레 패키지(노랑)
213000	,--	아이샤 해적 코스프레 패키지(검정)
213020	,--	레나 해적 코스프레 패키지(자두)
213040	,--	레이븐 해적 코스프레 패키지(하양)
213060	,--	이브 해적 코스프레 패키지(파랑)
90001393	,--	청 해적 코스프레 패키지(빨강)

115000220	,--	엘소드 유저 디자인 아바타(TR) 패키지(1p)
115000222	,--	아이샤 유저 디자인 아바타(TR) 패키지(1p)
115000224	,--	레나 유저 디자인 아바타(TR) 패키지(1p)
115000226	,--	레이븐 유저 디자인 아바타(TR) 패키지(1p)
115000228	,--	이브 유저 디자인 아바타(TR) 패키지(1p)
115000221	,--	엘소드 유저 디자인 아바타(TR) 패키지(2p)
115000223	,--	아이샤 유저 디자인 아바타(TR) 패키지(2p)
115000225	,--	레나 유저 디자인 아바타(TR) 패키지(2p)
115000227	,--	레이븐 유저 디자인 아바타(TR) 패키지(2p)
115000229	,--	이브 유저 디자인 아바타(TR) 패키지(2p)

218590	,--	엘소드 호랑이 코스프레  패키지 (빨강)
218610	,--	아이샤 고양이 코스프레  패키지 (빨강)
218630	,--	레나 여우 코스프레  패키지 (노랑)
218650	,--	레이븐 늑대 코스프레  패키지 (빨강)
218670	,--	이브 양 코스프레  패키지 (회갈색)
218600	,--	엘소드 호랑이 코스프레  패키지 (파랑)
218620	,--	아이샤 고양이 코스프레  패키지 (보라)
218640	,--	레나 여우 코스프레  패키지 (회색)
218660	,--	레이븐 늑대 코스프레  패키지 (파랑)
218680	,--	이브 양 코스프레  패키지 (검정)

204770	,--	사대부가 도령 한복 패키지 (파랑)
204790	,--	소녀 당의 한복 패키지 (하양)
204810	,--	황진 장미단 한복 패키지 (빨강)
204830	,--	방랑협객 두루마기 의관 패키지 (하양)
207510	,--	화양비단 궁중 당의 패키지(검정)
204780	,--	사대부가 도령 한복 패키지 (빨강)
204800	,--	소녀 당의 한복 패키지 (노랑)
204820	,--	황진 장미단 한복 패키지 (초록)
204840	,--	방랑협객 두루마기 의관 패키지 (파랑)
207520	,--	화양비단 궁중 당의 패키지(분홍)

212240	,--	엘소드 체커 썸머룩 패키지(파랑)
212260	,--	아이샤 리보닉 썸머룩 패키지(초록)
212280	,--	레나 엘핀 체커 썸머룩 패키지(파랑)
212300	,--	레이븐 체커 플라워 비치룩 패키지(한색)
212320	,--	이브 스쿨 스윔슈트 패키지(분홍)
85001142	,--	청 체커 사선 비치룩 패키지 (파랑)
212250	,--	엘소드 체커 썸머룩 패키지(빨강)
212270	,--	아이샤 리보닉 썸머룩 패키지(파랑)
212290	,--	레나 엘핀 체커 썸머룩 패키지(빨강)
212310	,--	레이븐 체커 플라워 비치룩 패키지(온색)
212330	,--	이브 스쿨 스윔슈트 패키지(검정)
85001143	,--	청 체커 사선 비치룩 패키지 (빨강)

120002980	,--	엘소드 판타지 절마사 패키지(빨강)
120002982	,--	아이샤 판타지 마봉술사 패키지(와인)
120002984	,--	레나 판타지 이블 헌터 패키지(남청)
120002986	,--	레이븐 판타지 뱀파이어 헌터 패키지(검정)
120002988	,--	이브 판타지 시스터 패키지(검정)
120002981	,--	엘소드 판타지 절마사 패키지(초록)
120002983	,--	아이샤 판타지 마봉술사 패키지(연녹)
120002985	,--	레나 판타지 이블 헌터 패키지(주황)
120002987	,--	레이븐 판타지 뱀파이어 헌터 패키지(하양)
120002989	,--	이브 판타지 시스터 패키지(하양)

115000290	,--	엘소드 유저 아바타 2차 콘테스트 패키지(2p)
115000292	,--	아이샤 유저 아바타 2차 콘테스트 패키지(1p)
115000294	,--	레나 유저 아바타 2차 콘테스트 패키지(1p)
115000296	,--	레이븐 유저 아바타 2차 콘테스트 패키지(1p)
115000298	,--	이브 유저 아바타 2차 콘테스트 패키지(1p)
115000291	,--	엘소드 유저 아바타 2차 콘테스트 패키지(1p)
115000293	,--	아이샤 유저 아바타 2차 콘테스트 패키지(2p)
115000295	,--	레나 유저 아바타 2차 콘테스트 패키지(2p)
115000297	,--	레이븐 유저 아바타 2차 콘테스트 패키지(2p)
115000299	,--	이브 유저 아바타 2차 콘테스트 패키지(2p)

222210	,--	엘소드 테니스 세트(파랑)
222230	,--	아이샤 테니스 세트(하양)
222250	,--	레나 테니스 세트(노랑)
222270	,--	레이븐 테니스 세트(하양)
222290	,--	이브 테니스 세트(노랑)
85001070	,--	청 테니스 세트(청록)
222220	,--	엘소드 테니스 세트(노랑)
222240	,--	아이샤 테니스 세트(검정)
222260	,--	레나 테니스 세트(검정)
222280	,--	레이븐 테니스 세트(검정)
222300	,--	이브 테니스 세트(분홍)
85001071	,--	청 테니스 세트(연두)

221430	,--	엘소드 5월의 웨딩 패키지(하양)
221450	,--	아이샤 5월의 웨딩 패키지(하양)
221470	,--	레나 5월의 웨딩 패키지(연노랑)
221490	,--	레이븐 5월의 웨딩 패키지(하양)
221510	,--	이브 5월의 웨딩 패키지(하양)
221440	,--	엘소드 5월의 웨딩 패키지(검정)
221460	,--	아이샤 5월의 웨딩 패키지(검정)
221480	,--	레나 5월의 웨딩 패키지(검정)
221500	,--	레이븐 5월의 웨딩 패키지(검정)
221520	,--	이브 5월의 웨딩 패키지(검정)

208220	,--	엘소드의 국선 화랑 의복 패키지(빨강)
208240	,--	아이샤의 단저고리 양단 개량 한복 패키지(주황)
208260	,--	레나의 장저고리 양단 개량 한복 패키지(빨강)
208280	,--	레이븐의 좌포청 포도대장 관복 패키지(빨강)
208300	,--	이브의 난초화 극장저고리 한복 패키지(초록)
208230	,--	엘소드의 선랑 화랑 의복 패키지(파랑)
208250	,--	아이샤의 단저고리 양단 개량 한복 패키지(빨강)
208270	,--	레나의 장저고리 양단 개량 한복 패키지(검정)
208290	,--	레이븐의 우포청 포도대장 관복 패키지(파랑)
208310	,--	이브의 난초화 극장저고리 한복 패키지(보라)

214270	,--	엘소드 썸머 캐쥬얼 패키지(검정)
214290	,--	아이샤 썸머 캐쥬얼 패키지(검정)
214310	,--	레나 썸머 캐쥬얼 패키지(검정)
214330	,--	레이븐 썸머 캐쥬얼 패키지(하양)
214350	,--	이브 썸머 캐쥬얼 패키지(검정)
85001122	,--	청 썸머 캐쥬얼 패키지(빨강)
214280	,--	엘소드 썸머 캐쥬얼 패키지(하늘)
214300	,--	아이샤 썸머 캐쥬얼 패키지(하양)
214320	,--	레나 썸머 캐쥬얼 패키지(노랑)
214340	,--	레이븐 썸머 캐쥬얼 패키지(노랑)
214360	,--	이브 썸머 캐쥬얼 패키지(하양)
85001123	,--	청 썸머 캐쥬얼 패키지(초록)

219870	,--	엘소드 겨울 스포츠 스키점프 패키지 (보라)
219890	,--	아이샤 겨울 스포츠 스노우보드 패키지 (보라)
219910	,--	레나 겨울 스포츠 스피드 스케이팅 패키지 (파랑)
219930	,--	레이븐 겨울 스포츠 아이스 하키 패키지 (파랑)
219950	,--	이브 겨울 스포츠 피겨 스케이팅 패키지 (파랑)
250000050	,--	청 겨울 스포츠 봅슬레이 패키지 (파랑)
219880	,--	엘소드 겨울 스포츠 스키점프 패키지 (빨강)
219900	,--	아이샤 겨울 스포츠 스노우보드 패키지 (분홍)
219920	,--	레나 겨울 스포츠 스피드 스케이팅 패키지 (보라)
219940	,--	레이븐 겨울 스포츠 아이스 하키 패키지 (주황)
219960	,--	이브 겨울 스포츠 피겨 스케이팅 패키지 (빨강)
250000051	,--	청 겨울 스포츠 봅슬레이 패키지 (검정)

217750	,--	엘소드 윈터 캐쥬얼 패키지 (빨강)
217770	,--	아이샤 윈터 캐쥬얼 패키지 (분홍)
217790	,--	레나 윈터 캐쥬얼 패키지 (노랑)
217810	,--	레이븐 윈터 캐쥬얼 패키지 (파랑)
217830	,--	이브 윈터 캐쥬얼 패키지 (빨강)
217760	,--	엘소드 윈터 캐쥬얼 패키지 (파랑)
217780	,--	아이샤 윈터 캐쥬얼 패키지 (회보라)
217800	,--	레나 윈터 캐쥬얼 패키지 (분홍)
217820	,--	레이븐 윈터 캐쥬얼 패키지 (적갈색)
217840	,--	이브 윈터 캐쥬얼 패키지 (노랑)

206630	,--	엘소드의 크리스마스 패키지(빨강)
206650	,--	아이샤의 크리스마스 패키지(빨강)
206670	,--	레나의 크리스마스 패키지(빨강)
206690	,--	레이븐의 크리스마스 패키지(빨강)
206710	,--	이브의 크리스마스 패키지(빨강)
259280	,--	청의 크리스마스 패키지(빨강)
206640	,--	엘소드의 크리스마스 패키지(검정)
206660	,--	아이샤의 크리스마스 패키지(검정)
206680	,--	레나의 크리스마스 패키지(검정)
206700	,--	레이븐의 크리스마스 패키지(검정)
206720	,--	이브의 크리스마스 패키지(검정)
259290	,--	청의 크리스마스 패키지(검정)

205850	,--	엘소드의 할로윈 의상 패키지(빨강)
205860	,--	엘소드의 할로윈 의상 패키지(청록)
205870	,--	아이샤의 할로윈 의상 패키지(주황)
205880	,--	아이샤의 할로윈 의상 패키지(빨강)
205890	,--	레나의 할로윈 의상 패키지(보라)
205900	,--	레나의 할로윈 의상 패키지(분홍)
205910	,--	레이븐의 할로윈 의상 패키지(파랑)
205920	,--	레이븐의 할로윈 의상 패키지(빨강)
115000080	,--	이브의 할로윈 의상 패키지(분홍)
115000090	,--	이브의 할로윈 의상 패키지(파랑)

211950	,--	엘소드 스타 아카데미 하복 하복 패키지(감청)
211970	,--	아이샤 스타 아카데미 하복 패키지(감청)
211990	,--	레나 스타 아카데미 하복 패키지(감청)
212010	,--	레이븐 스타 아카데미 하복 패키지(감청)
212030	,--	이브 스타 아카데미 하복 패키지(감청)
85001190	,--	청 스타 아카데미 하복 패키지(감청)
211960	,--	엘소드 스타 아카데미 하복 패키지(갈색)
211980	,--	아이샤 스타 아카데미 하복 패키지(갈색)
212000	,--	레나 스타 아카데미 하복 패키지(갈색)
212020	,--	레이븐 스타 아카데미 하복 패키지(갈색)
212040	,--	이브 스타 아카데미 하복 패키지(갈색)
85001191	,--	청 스타 아카데미 하복 패키지(갈색)

229180	,--	엘소드 2010 크리스마스 패키지(빨강)
229200	,--	아이샤 2010 크리스마스 패키지(빨강)
229220	,--	레나 2010 크리스마스 패키지(빨강)
229240	,--	레이븐 2010 크리스마스 패키지(빨강)
229260	,--	이브 2010 크리스마스 패키지(빨강)
229280	,--	청 2010 크리스마스 패키지(빨강)
229190	,--	엘소드 2010 크리스마스 패키지(보라)
229210	,--	아이샤 2010 크리스마스 패키지(보라)
229230	,--	레나 2010 크리스마스 패키지(보라)
229250	,--	레이븐 2010 크리스마스 패키지(보라)
229270	,--	이브 2010 크리스마스 패키지(보라)
229290	,--	청 2010 크리스마스 패키지(보라)

228260	,--	엘소드 타탄체크 의상 패키지(빨강)
228280	,--	아이샤 타탄체크 의상 패키지(자주)
228300	,--	레나 타탄체크 의상 패키지(자주)
228320	,--	레이븐 타탄체크 의상 패키지(빨강)
228340	,--	이브 타탄체크 의상 패키지(자주)
70002860	,--	청 타탄체크 의상 큐브(청록)
228270	,--	엘소드 타탄체크 의상 패키지(청록)
228290	,--	아이샤 타탄체크 의상 패키지(고동)
228310	,--	레나 타탄체크 의상 패키지(고동)
228330	,--	레이븐 타탄체크 의상 패키지(청록)
228350	,--	이브 타탄체크 의상 패키지(고동)
70002861	,--	청 타탄체크 의상 큐브(빨강)

227530	,--	배드 가이즈 엘소드 패키지(갈색)
227550	,--	배드 가이즈 아이샤 패키지(분홍)
227570	,--	배드 가이즈 레나 패키지(분홍)
227590	,--	배드 가이즈 레이븐 패키지(분홍)
227610	,--	배드 가이즈 이브 패키지(분홍)
70002310	,--	배드 가이즈 청 패키지(분홍)
227540	,--	배드 가이즈 엘소드 패키지(하늘)
227560	,--	배드 가이즈 아이샤 패키지(하늘)
227580	,--	배드 가이즈 레나 패키지(하늘)
227600	,--	배드 가이즈 레이븐 패키지(하늘)
227620	,--	배드 가이즈 이브 패키지(하늘)
70002311	,--	배드 가이즈 청 패키지(하늘)
}		
		
		
-- 캐시샵 아이템 왼쪽 상단의 띠		
		
ICON_LIMITED_ITEM =		
		
{
84001270	,--	생명의 결정 (봉술 팬더-레드)
84001272	,--	봉술 팬더-레드
84001274	,--	생명의 결정 (봉술 팬더-레드) 특별 패키지
84001276	,--	봉술 팬더-레드 특별 패키지

234020	,--	엘소드 웨스턴 건맨 패키지(고동)
234040	,--	아이샤 웨스턴 건레이디 패키지(갈색)
234060	,--	레나 웨스턴 카우걸 패키지(갈색)
234080	,--	레이븐 웨스턴 무법자 패키지(연갈)
234100	,--	이브 웨스턴 쉐리프 패키지(군청)
234120	,--	청 웨스턴 카우보이 패키지(연갈)
234030	,--	엘소드 웨스턴 건맨 패키지(와인)
234050	,--	아이샤 웨스턴 건레이디 패키지(와인)
234070	,--	레나 웨스턴 카우걸 패키지(와인)
234090	,--	레이븐 웨스턴 무법자 패키지(와인)
234110	,--	이브 웨스턴 쉐리프 패키지(분홍)
234130	,--	청 웨스턴 카우보이 패키지(와인)
		
250000020	,--	청 웨딩 아바타 패키지(하양)
250000021	,--	청 웨딩 아바타 패키지(검정)
		
235930	,--	엘소드 샤니베어 파자마 패키지(하늘)
235950	,--	아이샤 러블리 캣 파자마 패키지(분홍)
235970	,--	레나 나이트블룸 파자마 패키지(검정)
235990	,--	레이븐 하쉬드림 가운 패키지(하양)
236010	,--	이브 퓨어나잇 파자마 패키지(하양)
236030	,--	청 래핑카우 파자마 패키지(하양)
235940	,--	엘소드 샤니베어 파자마 패키지(주황)
235960	,--	아이샤 러블리 캣 파자마 패키지(보라)
235980	,--	레나 나이트블룸 파자마 패키지(분홍)
236000	,--	레이븐 하쉬드림 가운 패키지(주황)
236020	,--	이브 퓨어나잇 파자마 패키지(하늘)
236040	,--	청 래핑카우 파자마 패키지(노랑)




500260	,--	생명의 결정 (해츨링-라이트)
500300	,--	생명의 결정 (해츨링-라이트) 패키지
	
250000500	,--	독일 디자인 컨테스트 「Thomas Rensen」 청 패키지 (Ver.A)
250000501	,--	독일 디자인 컨테스트 「Thomas Rensen」 청 패키지 (Ver.B)

--이 아래로는 고정입니다 바꾸지 않으셔도 되요
--기본 아바타 로테이션 1
85001150	,--	엘소드 와일드 트레져 유니폼 패키지 (검정)
85001152	,--	아이샤 큐티 위치 드레스 패키지 (파랑)
85001154	,--	레나 포레스트 레인저 유니폼 패키지 (하양)
85001156	,--	레이븐 택티컬 캐쥬얼 패키지 (초록)
85001158	,--	이브 큐티 프레피 룩 패키지 (빨강)
85001160	,--	청 해양소년단제복 패키지 (파랑)
85001151	,--	엘소드 와일드 트레져 유니폼 패키지 (파랑)
85001153	,--	아이샤 큐티 위치 드레스 패키지 (자주)
85001155	,--	레나 포레스트 레인저 유니폼 패키지 (빨강)
85001157	,--	레이븐 택티컬 캐쥬얼 패키 (빨강)
85001159	,--	이브 큐티 프레피 룩 패키지 (청록)
85001161	,--	청 해양소년단제복 패키지 (분홍)

--기본 아바타 로테이션2
85001170	,--	엘소드 라이온하트 댄디룩 패키지 (주황)
85001172	,--	아이샤 그레이스 레이디 패키지 (빨강)
85001174	,--	레나 엘핀 캐쥬얼 수트 패키지 (하양)
85001176	,--	레이븐 킹덤 나이츠 패키지 (파랑)
85001178	,--	이브 와일드 트래커 패키지 (빨강)
85001180	,--	청 댄디크로스버클 패키지 (갈색)
85001171	,--	엘소드 라이온하트 댄디룩 패키지 (파랑)
85001173	,--	아이샤 그레이스 레이디 패키지 (파랑)
85001175	,--	레나 엘핀 캐쥬얼 수트 패키지 (청록)
85001177	,--	레이븐 킹덤 나이츠 패키지 (회색)
85001179	,--	이브 와일드 트래커 패키지 (파랑)
85001181	,--	청 댄디크로스버클 패키지 (하늘)

--기본 아바타 로테이션3
85001200	,--	엘소드 로열 가드 유니폼 패키지 (노랑)
85001210	,--	아이샤 미라지 레더 아머 패키지 (보라)
85001220	,--	레나 발키리 컴뱃 아머 패키지 (빨강)
85001230	,--	레이브 오컬트 체인 아이 패키지 (검정)
85001240	,--	이브 스타 스포티 룩 패키지 (빨강)
85001250	,--	청 세인트크로스가더 패키지 (보라)
85001201	,--	엘소드 로열 가드 유니폼 패키지 (회색)
85001211	,--	아이샤 미라지 레더 아머 패키지 (고동)
85001221	,--	레나 발키리 컴뱃 아머 패키지 (파랑)
85001231	,--	레이븐 오컬트 체인 아이 패키지 (하양)
85001241	,--	이브 스타 스포티 룩 패키지 (파랑)
85001251	,--	청 세인트크로스가더 패키지 (분홍)

--기본 아바타 로테이션4
85001260	,--	엘소드 패닝커트 유니폼 패키지 (파랑)
85001270	,--	아이샤 앨리스 유니폼 패키지 (파랑)
85001280	,--	레나 벨스타 헌터 패키지 (청록)
85001290	,--	레이븐 패딩 플레이트 아머 패키지 (빨강)
85001300	,--	이브 성 비비안 여학원 제복 패키지 (자주색)
85001310	,--	청 로열캐너니어 패키지 (파랑)
85001261	,--	엘소드 패닝커트 유니폼 패키지 (빨강)
85001271	,--	아이샤 앨리스 유니폼 패키지 (빨강)
85001281	,--	레나 벨스타 헌터 패키지 (고동)
85001291	,--	레이븐 패딩 플레이트 아머 패키지 (파랑)
85001301	,--	이브 성 비비안 여학원 제복 패키지 (회갈색)
85001311	,--	청 로열캐너니어 패키지 (하늘)

--기본 아바타 로테이션5
85001320	,--	엘소드 리틀 나이츠 패키지 (빨강)
85001330	,--	아이샤 프리티 위치 패키지 (파랑)
85001340	,--	레나 버클릭 밸리 패키지 (검정)
85001350	,--	레이븐 라이트 아미 패키지 (빨강)
85001360	,--	이브 키티 롤리타 드레스 패키지 (검정)
85001370	,--	청 에어기어룩 패키지 (파랑)
85001321	,--	엘소드 리틀 나이츠 패키지 (노랑)
85001331	,--	아이샤 프리티 위치 패키지 (보라)
85001341	,--	레나 버클릭 밸리 패키지 (빨강)
85001351	,--	레이븐 라이트 아미 패키지 (녹색)
85001361	,--	이브 키티 롤리타 드레스 패키지 (보라)
85001371	,--	청 에어기어룩 패키지 (빨강)


--기본 아바타 로테이션6
85001380	,--	엘소드 웨스턴 키드 패키지 (고동)
85001390	,--	아이샤 큐티 스쿨룩 패키지 (고동)
85001400	,--	레나 S라인 드레스 패키지 (하양)
85001410	,--	레이븐 웨스턴 터프가이 패키지 (고동)
85001420	,--	청 고스트헌터 패키지 (빨강)
85001381	,--	엘소드 웨스턴 키드 패키지 (빨강)
85001391	,--	아이샤 큐티 스쿨룩 패키지 (청록)
85001401	,--	레나 S라인 드레스 패키지 (다홍)
85001411	,--	레이븐 웨스턴 터프가이 패키지 (빨강)
85001421	,--	청 고스트헌터 패키지 (파랑)

--기본 아바타 로테이션7
85001430	,--	엘소드 혼 스파이크 패키지 (고동)
85001440	,--	아이샤 큐티 리본 패키지 (분홍)
85001450	,--	레나 럭셔리 헌터슈트 패키지 (하양)
85001460	,--	레이븐 철의 용병 패키지 (검정)
85001431	,--	엘소드 혼 스파이크 패키지 (하양)
85001441	,--	아이샤 큐티 리본 패키지 (노랑)
85001451	,--	레나 럭셔리 헌터슈트 패키지 (검정)
85001461	,--	레이븐 철의 용병 패키지 (초록)

--기본 아바타 로테이션8
85001470	,--	엘소드 크로스 버클 패키지 (빨강)
85001480	,--	아이샤 스컬 츄리닝 패키지 (보라)
85001490	,--	레나 체크 헌터 패키지 (빨강)
85001471	,--	엘소드 크로스 버클 패키지 (파랑)
85001481	,--	아이샤 스컬 츄리닝 패키지 (하양)
85001491	,--	레나 체크 헌터 패키지 (하양)

--기본 아바타 로테이션9
85001470	,--	엘소드 크로스 버클 패키지 (빨강)
85001480	,--	아이샤 스컬 츄리닝 패키지 (보라)
85001490	,--	레나 체크 헌터 패키지 (빨강)
85001471	,--	엘소드 크로스 버클 패키지 (파랑)
85001481	,--	아이샤 스컬 츄리닝 패키지 (하양)
85001491	,--	레나 체크 헌터 패키지 (하양)


--로테이션 영구판매1
211180	,--	밀리터리 룩 엘소드 패키지(암회색)
211200	,--	밀리터리 룩 아이샤 패키지(녹회색)
211220	,--	밀리터리 룩 레나 패키지(연노랑)
211240	,--	밀리터리 룩 레이븐 패키지(회갈색)
211260	,--	밀리터리 룩 이브 패키지(남색)
211190	,--	밀리터리 룩 엘소드 패키지(은백색)
211210	,--	밀리터리 룩 아이샤 패키지(회자색)
211230	,--	밀리터리 룩 레나 패키지(파랑)
211250	,--	밀리터리 룩 레이븐 패키지(녹회색)
211270	,--	밀리터리 룩 이브 패키지(흑갈색)

--로테이션 영구판매2
208920	,--	엘소드 스타 아카데미 패키지(감청)
208940	,--	아이샤 스타 아카데미 패키지(감청)
208960	,--	레나 스타 아카데미 패키지(감청)
208980	,--	레이븐 스타 아카데미 패키지(감청)
209000	,--	이브 스타 아카데미 패키지(감청)
208930	,--	엘소드 스타 아카데미 패키지(하양)
208950	,--	아이샤 스타 아카데미 패키지(하양)
208970	,--	레나 스타 아카데미 패키지(하양)
208990	,--	레이븐 스타 아카데미 패키지(하양)
209010	,--	이브 스타 아카데미 패키지(하양)

--로테이션 영구판매3
217040	,--	엘소드 천하일통 장수 패키지 (빨강)
217060	,--	아이샤 천하일통 장수 패키지 (보라)
217080	,--	레나 천하일통 장수 패키지 (분홍)
217100	,--	레이븐 천하일통 장수 패키지 (파랑)
217120	,--	이브 천하일통 장수 패키지 (검정)
217050	,--	엘소드 천하일통 장수 패키지 (파랑)
217070	,--	아이샤 천하일통 장수 패키지 (녹색)
217090	,--	레나 천하일통 장수 패키지 (연두)
217110	,--	레이븐 천하일통 장수 패키지 (빨강)
217130	,--	이브 천하일통 장수 패키지 (하양)

--유럽 로테이션
115000060	,--	엘소드 유카타 패키지(빨강)
115000062	,--	아이샤 유카타 패키지(자주)
115000064	,--	레나 유카타 패키지(하늘)
115000066	,--	레이븐 유카타 패키지(파랑)
115000068	,--	이브 유카타 패키지(분홍)
115000061	,--	엘소드 유카타 패키지(하양)
115000063	,--	아이샤 유카타 패키지(분홍)
115000065	,--	레나 유카타 패키지(자주)
115000067	,--	레이븐 유카타 패키지(고동)
115000069	,--	이브 유카타 패키지(노랑)

210270	,--	아이돌 밴드 엘소드 패키지(분홍)
210290	,--	아이돌 밴드 아이샤 패키지(분홍)
210310	,--	파워풀 디바 레나 패키지(하양)
210330	,--	월드스타 레이븐 패키지(회색)
210350	,--	프린세스 아이돌 이브 패키지(분홍)
85001580	,--	아이돌 밴드 청 패키지(노랑)
210280	,--	아이돌 밴드 엘소드 패키지(연두)
210300	,--	아이돌 밴드 아이샤 패키지(노랑)
210320	,--	파워풀 디바 레나 패키지(노랑)
210340	,--	월드스타 레이븐 패키지(노랑)
210360	,--	프린세스 아이돌 이브 패키지(연두)
85001581	,--	아이돌 밴드 청 패키지(연두)

212970	,--	엘소드 해적 코스프레 패키지(빨강)
212990	,--	아이샤 해적 코스프레 패키지(파랑)
213010	,--	레나 해적 코스프레 패키지(청록)
213030	,--	레이븐 해적 코스프레 패키지(검정)
213050	,--	이브 해적 코스프레 패키지(고동)
90001392	,--	청 해적 코스프레 패키지(검정)
212980	,--	엘소드 해적 코스프레 패키지(노랑)
213000	,--	아이샤 해적 코스프레 패키지(검정)
213020	,--	레나 해적 코스프레 패키지(자두)
213040	,--	레이븐 해적 코스프레 패키지(하양)
213060	,--	이브 해적 코스프레 패키지(파랑)
90001393	,--	청 해적 코스프레 패키지(빨강)

115000220	,--	엘소드 유저 디자인 아바타(TR) 패키지(1p)
115000222	,--	아이샤 유저 디자인 아바타(TR) 패키지(1p)
115000224	,--	레나 유저 디자인 아바타(TR) 패키지(1p)
115000226	,--	레이븐 유저 디자인 아바타(TR) 패키지(1p)
115000228	,--	이브 유저 디자인 아바타(TR) 패키지(1p)
115000221	,--	엘소드 유저 디자인 아바타(TR) 패키지(2p)
115000223	,--	아이샤 유저 디자인 아바타(TR) 패키지(2p)
115000225	,--	레나 유저 디자인 아바타(TR) 패키지(2p)
115000227	,--	레이븐 유저 디자인 아바타(TR) 패키지(2p)
115000229	,--	이브 유저 디자인 아바타(TR) 패키지(2p)

218590	,--	엘소드 호랑이 코스프레  패키지 (빨강)
218610	,--	아이샤 고양이 코스프레  패키지 (빨강)
218630	,--	레나 여우 코스프레  패키지 (노랑)
218650	,--	레이븐 늑대 코스프레  패키지 (빨강)
218670	,--	이브 양 코스프레  패키지 (회갈색)
218600	,--	엘소드 호랑이 코스프레  패키지 (파랑)
218620	,--	아이샤 고양이 코스프레  패키지 (보라)
218640	,--	레나 여우 코스프레  패키지 (회색)
218660	,--	레이븐 늑대 코스프레  패키지 (파랑)
218680	,--	이브 양 코스프레  패키지 (검정)

204770	,--	사대부가 도령 한복 패키지 (파랑)
204790	,--	소녀 당의 한복 패키지 (하양)
204810	,--	황진 장미단 한복 패키지 (빨강)
204830	,--	방랑협객 두루마기 의관 패키지 (하양)
207510	,--	화양비단 궁중 당의 패키지(검정)
204780	,--	사대부가 도령 한복 패키지 (빨강)
204800	,--	소녀 당의 한복 패키지 (노랑)
204820	,--	황진 장미단 한복 패키지 (초록)
204840	,--	방랑협객 두루마기 의관 패키지 (파랑)
207520	,--	화양비단 궁중 당의 패키지(분홍)

212240	,--	엘소드 체커 썸머룩 패키지(파랑)
212260	,--	아이샤 리보닉 썸머룩 패키지(초록)
212280	,--	레나 엘핀 체커 썸머룩 패키지(파랑)
212300	,--	레이븐 체커 플라워 비치룩 패키지(한색)
212320	,--	이브 스쿨 스윔슈트 패키지(분홍)
85001142	,--	청 체커 사선 비치룩 패키지 (파랑)
212250	,--	엘소드 체커 썸머룩 패키지(빨강)
212270	,--	아이샤 리보닉 썸머룩 패키지(파랑)
212290	,--	레나 엘핀 체커 썸머룩 패키지(빨강)
212310	,--	레이븐 체커 플라워 비치룩 패키지(온색)
212330	,--	이브 스쿨 스윔슈트 패키지(검정)
85001143	,--	청 체커 사선 비치룩 패키지 (빨강)

120002980	,--	엘소드 판타지 절마사 패키지(빨강)
120002982	,--	아이샤 판타지 마봉술사 패키지(와인)
120002984	,--	레나 판타지 이블 헌터 패키지(남청)
120002986	,--	레이븐 판타지 뱀파이어 헌터 패키지(검정)
120002988	,--	이브 판타지 시스터 패키지(검정)
120002981	,--	엘소드 판타지 절마사 패키지(초록)
120002983	,--	아이샤 판타지 마봉술사 패키지(연녹)
120002985	,--	레나 판타지 이블 헌터 패키지(주황)
120002987	,--	레이븐 판타지 뱀파이어 헌터 패키지(하양)
120002989	,--	이브 판타지 시스터 패키지(하양)

115000290	,--	엘소드 유저 아바타 2차 콘테스트 패키지(2p)
115000292	,--	아이샤 유저 아바타 2차 콘테스트 패키지(1p)
115000294	,--	레나 유저 아바타 2차 콘테스트 패키지(1p)
115000296	,--	레이븐 유저 아바타 2차 콘테스트 패키지(1p)
115000298	,--	이브 유저 아바타 2차 콘테스트 패키지(1p)
115000291	,--	엘소드 유저 아바타 2차 콘테스트 패키지(1p)
115000293	,--	아이샤 유저 아바타 2차 콘테스트 패키지(2p)
115000295	,--	레나 유저 아바타 2차 콘테스트 패키지(2p)
115000297	,--	레이븐 유저 아바타 2차 콘테스트 패키지(2p)
115000299	,--	이브 유저 아바타 2차 콘테스트 패키지(2p)

222210	,--	엘소드 테니스 세트(파랑)
222230	,--	아이샤 테니스 세트(하양)
222250	,--	레나 테니스 세트(노랑)
222270	,--	레이븐 테니스 세트(하양)
222290	,--	이브 테니스 세트(노랑)
85001070	,--	청 테니스 세트(청록)
222220	,--	엘소드 테니스 세트(노랑)
222240	,--	아이샤 테니스 세트(검정)
222260	,--	레나 테니스 세트(검정)
222280	,--	레이븐 테니스 세트(검정)
222300	,--	이브 테니스 세트(분홍)
85001071	,--	청 테니스 세트(연두)

221430	,--	엘소드 5월의 웨딩 패키지(하양)
221450	,--	아이샤 5월의 웨딩 패키지(하양)
221470	,--	레나 5월의 웨딩 패키지(연노랑)
221490	,--	레이븐 5월의 웨딩 패키지(하양)
221510	,--	이브 5월의 웨딩 패키지(하양)
221440	,--	엘소드 5월의 웨딩 패키지(검정)
221460	,--	아이샤 5월의 웨딩 패키지(검정)
221480	,--	레나 5월의 웨딩 패키지(검정)
221500	,--	레이븐 5월의 웨딩 패키지(검정)
221520	,--	이브 5월의 웨딩 패키지(검정)

208220	,--	엘소드의 국선 화랑 의복 패키지(빨강)
208240	,--	아이샤의 단저고리 양단 개량 한복 패키지(주황)
208260	,--	레나의 장저고리 양단 개량 한복 패키지(빨강)
208280	,--	레이븐의 좌포청 포도대장 관복 패키지(빨강)
208300	,--	이브의 난초화 극장저고리 한복 패키지(초록)
208230	,--	엘소드의 선랑 화랑 의복 패키지(파랑)
208250	,--	아이샤의 단저고리 양단 개량 한복 패키지(빨강)
208270	,--	레나의 장저고리 양단 개량 한복 패키지(검정)
208290	,--	레이븐의 우포청 포도대장 관복 패키지(파랑)
208310	,--	이브의 난초화 극장저고리 한복 패키지(보라)

214270	,--	엘소드 썸머 캐쥬얼 패키지(검정)
214290	,--	아이샤 썸머 캐쥬얼 패키지(검정)
214310	,--	레나 썸머 캐쥬얼 패키지(검정)
214330	,--	레이븐 썸머 캐쥬얼 패키지(하양)
214350	,--	이브 썸머 캐쥬얼 패키지(검정)
85001122	,--	청 썸머 캐쥬얼 패키지(빨강)
214280	,--	엘소드 썸머 캐쥬얼 패키지(하늘)
214300	,--	아이샤 썸머 캐쥬얼 패키지(하양)
214320	,--	레나 썸머 캐쥬얼 패키지(노랑)
214340	,--	레이븐 썸머 캐쥬얼 패키지(노랑)
214360	,--	이브 썸머 캐쥬얼 패키지(하양)
85001123	,--	청 썸머 캐쥬얼 패키지(초록)

219870	,--	엘소드 겨울 스포츠 스키점프 패키지 (보라)
219890	,--	아이샤 겨울 스포츠 스노우보드 패키지 (보라)
219910	,--	레나 겨울 스포츠 스피드 스케이팅 패키지 (파랑)
219930	,--	레이븐 겨울 스포츠 아이스 하키 패키지 (파랑)
219950	,--	이브 겨울 스포츠 피겨 스케이팅 패키지 (파랑)
250000050	,--	청 겨울 스포츠 봅슬레이 패키지 (파랑)
219880	,--	엘소드 겨울 스포츠 스키점프 패키지 (빨강)
219900	,--	아이샤 겨울 스포츠 스노우보드 패키지 (분홍)
219920	,--	레나 겨울 스포츠 스피드 스케이팅 패키지 (보라)
219940	,--	레이븐 겨울 스포츠 아이스 하키 패키지 (주황)
219960	,--	이브 겨울 스포츠 피겨 스케이팅 패키지 (빨강)
250000051	,--	청 겨울 스포츠 봅슬레이 패키지 (검정)

217750	,--	엘소드 윈터 캐쥬얼 패키지 (빨강)
217770	,--	아이샤 윈터 캐쥬얼 패키지 (분홍)
217790	,--	레나 윈터 캐쥬얼 패키지 (노랑)
217810	,--	레이븐 윈터 캐쥬얼 패키지 (파랑)
217830	,--	이브 윈터 캐쥬얼 패키지 (빨강)
217760	,--	엘소드 윈터 캐쥬얼 패키지 (파랑)
217780	,--	아이샤 윈터 캐쥬얼 패키지 (회보라)
217800	,--	레나 윈터 캐쥬얼 패키지 (분홍)
217820	,--	레이븐 윈터 캐쥬얼 패키지 (적갈색)
217840	,--	이브 윈터 캐쥬얼 패키지 (노랑)

206630	,--	엘소드의 크리스마스 패키지(빨강)
206650	,--	아이샤의 크리스마스 패키지(빨강)
206670	,--	레나의 크리스마스 패키지(빨강)
206690	,--	레이븐의 크리스마스 패키지(빨강)
206710	,--	이브의 크리스마스 패키지(빨강)
259280	,--	청의 크리스마스 패키지(빨강)
206640	,--	엘소드의 크리스마스 패키지(검정)
206660	,--	아이샤의 크리스마스 패키지(검정)
206680	,--	레나의 크리스마스 패키지(검정)
206700	,--	레이븐의 크리스마스 패키지(검정)
206720	,--	이브의 크리스마스 패키지(검정)
259290	,--	청의 크리스마스 패키지(검정)

205850	,--	엘소드의 할로윈 의상 패키지(빨강)
205860	,--	엘소드의 할로윈 의상 패키지(청록)
205870	,--	아이샤의 할로윈 의상 패키지(주황)
205880	,--	아이샤의 할로윈 의상 패키지(빨강)
205890	,--	레나의 할로윈 의상 패키지(보라)
205900	,--	레나의 할로윈 의상 패키지(분홍)
205910	,--	레이븐의 할로윈 의상 패키지(파랑)
205920	,--	레이븐의 할로윈 의상 패키지(빨강)
115000080	,--	이브의 할로윈 의상 패키지(분홍)
115000090	,--	이브의 할로윈 의상 패키지(파랑)

211950	,--	엘소드 스타 아카데미 하복 하복 패키지(감청)
211970	,--	아이샤 스타 아카데미 하복 패키지(감청)
211990	,--	레나 스타 아카데미 하복 패키지(감청)
212010	,--	레이븐 스타 아카데미 하복 패키지(감청)
212030	,--	이브 스타 아카데미 하복 패키지(감청)
85001190	,--	청 스타 아카데미 하복 패키지(감청)
211960	,--	엘소드 스타 아카데미 하복 패키지(갈색)
211980	,--	아이샤 스타 아카데미 하복 패키지(갈색)
212000	,--	레나 스타 아카데미 하복 패키지(갈색)
212020	,--	레이븐 스타 아카데미 하복 패키지(갈색)
212040	,--	이브 스타 아카데미 하복 패키지(갈색)
85001191	,--	청 스타 아카데미 하복 패키지(갈색)

229180	,--	엘소드 2010 크리스마스 패키지(빨강)
229200	,--	아이샤 2010 크리스마스 패키지(빨강)
229220	,--	레나 2010 크리스마스 패키지(빨강)
229240	,--	레이븐 2010 크리스마스 패키지(빨강)
229260	,--	이브 2010 크리스마스 패키지(빨강)
229280	,--	청 2010 크리스마스 패키지(빨강)
229190	,--	엘소드 2010 크리스마스 패키지(보라)
229210	,--	아이샤 2010 크리스마스 패키지(보라)
229230	,--	레나 2010 크리스마스 패키지(보라)
229250	,--	레이븐 2010 크리스마스 패키지(보라)
229270	,--	이브 2010 크리스마스 패키지(보라)
229290	,--	청 2010 크리스마스 패키지(보라)

228260	,--	엘소드 타탄체크 의상 패키지(빨강)
228280	,--	아이샤 타탄체크 의상 패키지(자주)
228300	,--	레나 타탄체크 의상 패키지(자주)
228320	,--	레이븐 타탄체크 의상 패키지(빨강)
228340	,--	이브 타탄체크 의상 패키지(자주)
70002860	,--	청 타탄체크 의상 큐브(청록)
228270	,--	엘소드 타탄체크 의상 패키지(청록)
228290	,--	아이샤 타탄체크 의상 패키지(고동)
228310	,--	레나 타탄체크 의상 패키지(고동)
228330	,--	레이븐 타탄체크 의상 패키지(청록)
228350	,--	이브 타탄체크 의상 패키지(고동)
70002861	,--	청 타탄체크 의상 큐브(빨강)

227530	,--	배드 가이즈 엘소드 패키지(갈색)
227550	,--	배드 가이즈 아이샤 패키지(분홍)
227570	,--	배드 가이즈 레나 패키지(분홍)
227590	,--	배드 가이즈 레이븐 패키지(분홍)
227610	,--	배드 가이즈 이브 패키지(분홍)
70002310	,--	배드 가이즈 청 패키지(분홍)
227540	,--	배드 가이즈 엘소드 패키지(하늘)
227560	,--	배드 가이즈 아이샤 패키지(하늘)
227580	,--	배드 가이즈 레나 패키지(하늘)
227600	,--	배드 가이즈 레이븐 패키지(하늘)
227620	,--	배드 가이즈 이브 패키지(하늘)
70002311	,--	배드 가이즈 청 패키지(하늘)

}		
		
		
ICON_EVENT_ITEM =		
		
{

60005040	,--	엘소드 몬스터 카드 수집가의 모자
60005041	,--	아이샤 몬스터 카드 수집가의 모자
60005042	,--	레나 몬스터 카드 수집가의 모자
60005043	,--	레이븐 몬스터 카드 수집가의 모자
60005044	,--	이브 몬스터 카드 수집가의 모자
60005045	,--	청 몬스터 카드 수집가의 모자

60005029	,--	카드 수집가 가방 업그레이드권
85002328	,--	투사의 방패

	
90000413	,--	아리엘의 메리 메이커

210570,--	얼음 조각상 가열기 10+3 큐브	
210560,--	얼음 조각상 가열기 5+1 큐브	
210550,--	얼음 조각상 가열기 1+1 큐브	

135088	,--	 코드 분석 회로

85002065	,--	제련된 고대 나소드 합금
}		
		
		
		
ICON_HOT_ITEM = 		
{	
85002441	,--	얼음 조각상 가열기(레이븐, 이브, 청 나소드 배틀 슈트)
85002451	,--	얼음 조각상 가열기(나소드 배틀 슈트)


237240	,--	머리 위의 고양이(코숏)
237250	,--	머리 위의 고양이(터키쉬)
237260	,--	머리 위의 고양이(샴)
237270	,--	머리 위의 고양이(봄베이)

244610	,--	홍조(뿌잉뿌잉)
244620	,--	홍조(새침)
180001	,--	두근두근 하트 안경

133345	,--	드림 스텝 - 윈드
251740	,--	블루 엔젤 귀요미 날개
251750	,--	핑크 엔젤 귀요미 날개

233250	,--	웨스턴 건맨 미니미
233260	,--	웨스턴 건맨 라이플
233270	,--	웨스턴 건맨 다이너마이트 키트



250000200	,--	롭이어 토끼 꼬리 (하양)
250000201	,--	롭이어 토끼 꼬리 (살색)

130716	,--	투지의 암 가드
131284	,--	맹세의 완장
		
133346	,--	드림 스텝 - 스타
181467	,--	러블리 락앤롤 기타
251730	,--	블랙 락앤롤 기타 
		
180151	,--	애완용 쁘띠뽀루

	
207500,--얼음조각상가열기	

133344	,--	드림 스텝 - 플레어
209040	,--	빈티지 레더 크로스 백
234230	,--	반장 안경

244600	,--	다크서클
244630	,--	가슴을 적시는 눈물

500400	,--	조디악-파이시즈(물고기 자리)

207490	,--	앙증맞은 사슴 귀

243310	,--	드림 스텝 - 눈꽃
500390	,--	조디악-아쿠아리우스(물병 자리)
250000036	,--	겨울 스포츠 스켈레톤 (파랑)
250000046	,--	겨울 스포츠 스켈레톤 (검정)

214400	,--	뽀루의 발 도장 (황금색)

500230	,--	생명의 결정 (해츨링)

206020	,--	여우 꼬리

215660	,--	코보 익스프레스 VIP 티켓
215670	,--	마나민트 츄잉껌
75000600	,--	마법의 목걸이
244560	,--	퀵슬롯 확장권
65000701	,--	루리엘의 신용 보증서

206770	,--	플루오르 스톤 Lv.5
206920	,--	축복받은 복원의 주문서 Lv.5
206760,--플루오르 스톤 Lv.4		
206910,--축복받은 복원의 주문서 Lv.4		
206750,--플루오르 스톤 Lv.3		
206900,--축복받은 복원의 주문서 Lv.3	

214410,--소드 나이트의 증명		
214420,--매직 나이트의 증명		
242310	,--	시스 나이트의 증명
214430,--하이 매지션의 기억		
214440,--다크 매지션의 기억		
242320	,--	배틀 매지션의 기억
214450,--컴뱃 레인저의 영혼		
214460,--스나이핑 레인저의 영혼
242330	,--	트래핑 레인저의 영혼	
214470,--소드 테이커의 계시		
214480,--오버 테이커의 계시		
217970,--네메시스 블레이드		
217980,--엠프레스 티아라
229460	,--	퓨리 가디언의 결의
229470	,--	슈팅 가디언의 결의		
		
213260,--아머브레이크		
213270,--대폭살		
213280,--메디테이션		
213290,--마나인테이크		
213300,--로우킥		
213310,--인탱글		
213360,--윈드밀		
213370,--소드파이어		
213380,--데스필드		
213390,--블리자드 샤워		
213400,--샤프폴		
213410,--윈드워드		
215210,--더블 슬래시		
215220,--피닉스 탤런		
215230,--에이징		
215240,--블레이즈 스탭		
215250,--바이올런트 어택		
215260,--궁그닐		
213320,--컷텐던		
213330,--웨폰브레이크		
213420,--쇼크웨이브		
213430,--발키리스자벨린		
215270,--블러디 액셀		
215280,--뉴클리어		
213340,--메탈더스트오라		
213350,--오베론가드		
213440,--아이언 스크랩스		
213450,--스페이스 랜치		
215290,--정크 브레이크		
215300,--헤븐즈 피스트		
229490	,--	가드
229500	,--	럼블샷
233170	,--	판데모니움
233190	,--	카밋 크래셔
233180	,--	칼라드볼그 페인
233200	,--	샤프슈터 신드롬
241490	,--	하쉬 체이서
241500	,--	메일스톰 레이지
241510	,--	팬텀 소드
241520	,--	에너지 드레인
241530	,--	길로틴 프레스
241540	,--	매지컬 메이크업
241550	,--	폭발의 덫
241560	,--	페이탈리티
241570	,--	콜 오브 루인

	
216420,--로드나이트 임명장		
216430,--룬 슬레이어 징표		
217920,--엘리멘탈 마스터의 비약		
217930,--보이드 프린세스의 계약서		
217850,--윈드 스니커의 격투 교본		
217860,--그랜드 아처의 궁술 교본		
217950,--블레이드 마스터의 비전		
217960,--레크리스 피스트의 핵		
214490,--코드 엑조틱의 메모리		
214500,--코드 아키텍처의 메모리	
235120	,--	수호자의 형상
235130	,--	추적자의 형상

228360,--	고통억제	
228370,--	마법저항수련	
228380,--	풍요의기운	
228390,--	극한의마나운용	
228400,--	자연과의친화	
228410,--	진동사격	
228420,--	긴급탈출!	
228430,--	승화된분노	
228440,--	집중의기운	
228450,--	충전추진기	
235080	,--	굳건한 의지
235090	,--	강렬한 쇼타임

221600,--기술의 노트		

601003,--끝없는 공격 그 이론과 실재		
601009,--정확하고 강한 타격		
601011,--갑옷 붕괴		
601004,--양적 향상에 대한 생각Ⅰ		
601010,--영혼 파괴		
601012,--꺼지지 않는 불길		
602003,--생각대로 미사일		
602009,--열기 폭발		
602011,--자유로운 영혼		
602004,--독을 쓸 때에는 자비심 없이		
602010,--리드미컬한 회전		
602012,--끝없는 갈망		
603003,--임계점 돌파		
603009,--급습		
603011,--명품 발차기		
603004,--뒤쫓기만 해서는 곤란		
603010,--공기 응축법		
603012,--덫 숙련		
604003,--어지러움에 면역		
604009,--약점 간파		
604011,--아물지 않는 상처		
604004,--폭파		
604010,--볼트 출력 강화		
604012,--효과적인 무기 파괴		
605003,--처음은 살살Ⅰ		
605004,--처음은 살살Ⅱ		
605009,--특제 나소드 고폭탄		
605010,--도움이 되기 위한 훈련		
605011,--짧고 굵게!		
605012,--오펜스 모드 전환!	
606003	,--	기합포
606004	,--	느와르 액션
601013	,--	꿰뚫는 검
601014	,--	치명적인 일격
601015	,--	칼의 비
602013	,--	파워 드레인
602014	,--	마력을 담은 망치질
602015	,--	에너지의 링
603013	,--	폭발물 취급 주의
603014	,--	추격하는 정령
603015	,--	재활용을 위한 준비



}		
