-- lua header. UTF-8 인코딩 인식을 위해 이 줄은 지우지 마세요.

--[[
u	// ┌
d	// └
m   // ㅏ
|   // |

j   // double jump
J	// jump
D	// down
W	// walk
R	// run
A	// Dash Jump

Z	  // z
X	  // x
1   // Up Z
2   // Down Z
3   // Up X
4   // Down X
5   // Right Z
6   // Left Z
7   // Right X
8   // Left X
--]]



COMBO_GUIDE = {}

-- 노전직 엘소드
COMBO_GUIDE[ UNIT_CLASS["UC_ELSWORD_SWORDMAN"] ] =
{
    COMBO_COMMAND0 = 
    {
        { "Z" },                --루트
        { "u", 2, 0, "N" },     --┌
        { "R", 3, 0, "ZZZR" },  --대시 	
        { "Z", 0, 1, "Z" },     --기본 z
        { "Z", 1, 1, "ZZ" },    --제트 콤보 두번째
        { "Z", 2, 1, "ZZZ" },   --제트 콤보 세개 
        { "Z", 3, 1, "ZZZZ" },  --제트 콤보 4개 
        { "d", 2, 2, "N" },     --아래쪽 꺽쇠 
        { "X", 3, 2, "ZZZX" },  --3,2 좌표에 X
    },
    COMBO_COMMAND1 = 
    {
        { "X" },
        { "X", 0, 0, "X" },
        { "X", 1, 0, "XX" },
        { "X", 2, 0, "XXX" },
        { "d", 1, 1, "N" },
        { "Z", 2, 1, "XXZ" },
    },
    COMBO_COMMAND2 = 
    {
        { "R" },
        { "u", 0, 0, "N" },
        { "J", 1, 0, "A" },
        { "R", 0, 1, "R" },
        { "Z", 1, 1, "RZ" },
        { "Z", 2, 1, "RZZ" },
        { "d", 0, 2, "N" },
        { "X", 1, 2, "RX" },
    },
    COMBO_COMMAND3 = 
    {
        { "J" },
        { "u", 0, 0, "N" },
        { "R", 1, 0, "A" },    
        { "J", 0, 1, "J" },
        { "Z", 1, 1, "JZ" },
        { "d", 0, 2, "N" },
        { "X", 1, 2, "JX" },
    },
    COMBO_COMMAND4 = 
    {
        { "A" },
        { "A", 0, 0, "A" },
        { "Z", 2, 0, "AZ" },
        { "Z", 3, 0, "AZZ" },
        { "Z", 4, 0, "AZZZ" },
        { "d", 1, 1, "N" },
        { "X", 2, 1, "AX" },
        { "X", 3, 1, "AXX" },
    },  
}

-- 노전직 레나
COMBO_GUIDE[ UNIT_CLASS["UC_LIRE_ELVEN_RANGER"] ] =
{
    COMBO_COMMAND0 = 
    {
        { "Z" },
        { "u", 2, 0, "N" },
        { "1", 3, 0, "ZZZUpZ" },
        { "Z", 0, 1, "Z" },
        { "Z", 1, 1, "ZZ" },
        { "Z", 2, 1, "ZZZ" },
        { "Z", 3, 1, "ZZZZ" },
        { "d", 2, 2, "N" },
        { "X", 3, 2, "ZZZX" },
    },
    COMBO_COMMAND1 = 
    {
        { "X" },
        { "u", 2, 0, "N" },
        { "3", 3, 0, "XXXUpX" },
        { "X", 0, 1, "X" },
        { "X", 1, 1, "XX" },
        { "X", 2, 1, "XXX" },
        { "X", 3, 1, "XXXX" },
        { "d", 2, 2, "N" },
        { "4", 3, 2, "XXXDownX" },
    },
    COMBO_COMMAND2 = 
    {
        { "R" },
        { "u", 0, 0, "N" },
        { "J", 1, 0, "A" },    
        { "R", 0, 1, "R" },
        { "Z", 1, 1, "RZ" },
        { "Z", 2, 1, "RZZ" },
        { "d", 0, 2, "N" },
        { "X", 1, 2, "RX" },    
    },

    COMBO_COMMAND3 = 
    {
        { "J" },
        { "u", 0, 0, "N"},
        { "J", 1, 0, "JJ"},
        { "J", 0, 1, "J"},
        { "Z", 1, 1, "JZ"},
        { "d", 0, 2, "N"},
        { "X", 1, 2, "JX"},
    },

    COMBO_COMMAND4 = 
    {
        { "j" }, 
        { "j", 0, 0, "JJ"},	
        { "Z", 2, 0, "JJZ"},
        { "d", 1, 1, "N"},
        { "X", 2, 1, "JJX"},
    },

    COMBO_COMMAND5 = 
    {
        { "A" },
        { "u", 1, 0, "N"},
        { "J", 2, 0, "J"},
        { "A", 0, 1, "A"},
        { "Z", 2, 1, "AZ"},
        { "d", 1, 2, "N"},
        { "X", 2, 2, "AX"},
        { "X", 3, 2, "AXX"},
        { "X", 4, 2, "AXXX"},
    },
}



-- 노전직 레이븐
COMBO_GUIDE[ UNIT_CLASS["UC_RAVEN_FIGHTER"] ] =
    {
    COMBO_COMMAND0 = 
    {
        { "Z" },
        { "u", 2, 0, "N"},
        { "R", 3, 0, "ZZZR"},
        { "Z", 0, 1, "Z"} ,
        { "Z", 1, 1, "ZZ"},
        { "Z", 2, 1, "ZZZ"},
        { "Z", 3, 1, "ZZZZ"},
        { "d", 2, 2, "N"},
        { "X", 3, 2, "ZZZX"},
        { "|", 1, 2, "N"},
        { "d", 1, 3, "N"},
        { "X", 2, 3, "ZZX"},
        { "X", 3, 3, "ZZXX"},
    },
    COMBO_COMMAND1 = 
    {
        { "X" },
        { "X", 0, 1, "X" },
        { "X", 1, 1, "XX" },
        { "X", 2, 1, "XXX" },
    },
    COMBO_COMMAND2 = 
    {
        { "R" },
        { "u", 0, 0, "N" },
        { "J", 1, 0, "A" },  
        { "R", 0, 1, "R" },
        { "Z", 1, 1, "RZ"},
        { "Z", 2, 1, "RZZ"},
        { "d", 0, 2, "N"},
        { "X", 1, 2, "RX"},
    },
    COMBO_COMMAND3 = 
    {
        { "J" },
        { "u", 0, 0, "N" },
        { "R", 1, 0, "A"},
        { "J", 0, 1, "J"},
        { "Z", 1, 1, "JZ"},
        { "d", 0, 2, "N"},
        { "X", 1, 2, "JX"},
    },
    COMBO_COMMAND4 = 
    {
        { "A" },
        { "A", 0, 0, "A"},
        { "Z", 2, 0, "AZ"},
        { "Z", 3, 0, "AZZ"},
        { "d", 1, 1, "N"},
        { "X", 2, 1, "AX"},
    },
}

--노전직 아이샤
COMBO_GUIDE[ UNIT_CLASS["UC_ARME_VIOLET_MAGE"] ] = 
{
    COMBO_COMMAND0 = 
    {
        { "Z" },
        { "u", 1, 0, "N"},
        { "1", 2, 0, "ZZupZ"},
        { "Z", 4, 0, "ZZupZZ"},
        { "Z", 0, 1, "Z"},
        { "Z", 1, 1, "ZZ"},
        { "Z", 2, 1, "ZZZ"},
    },


    COMBO_COMMAND1 = 
    {
        { "X" },
        { "u", 1, 0, "N"},
        { "7", 2, 0, "XXRightX"},
        { "X", 0, 1, "X"},
        { "X", 1, 1, "XX"},
        { "X", 2, 1, "XXX"},
        { "d", 1, 2, "N"},        
        { "4", 2, 2, "XXDownX"},
    },

    COMBO_COMMAND2 = 
    {
        { "R" },
        { "u", 0, 0, "N"},
        { "J", 1, 0, "A"},
        { "R", 0, 1, "R"},
        { "Z", 1, 1, "RZ"},
        { "Z", 2, 1, "RZZ"},
        { "d", 1, 2, "N"},
        { "X", 2, 2, "RZX"},
        { "|", 0, 2, "N"},
        { "d", 0, 3, "N"},
        { "X", 1, 3, "RX"},
    },

    COMBO_COMMAND3 = 
    {
        { "J" },        
        { "J", 0, 0, "J"},
        { "Z", 1, 0, "JZ"},
        { "d", 0, 1, "N"},
        { "X", 1, 1, "JX"},
    },

    COMBO_COMMAND4 = 
    {
        { "A" },
        { "A", 0, 0, "A"},
        { "Z", 2, 0, "AZ"},
        { "d", 1, 1, "N"},
        { "X", 2, 1, "AX"},
        { "X", 3, 1, "AXX"},
    },
}
  
  
--노전직 이브
COMBO_GUIDE[ UNIT_CLASS["UC_EVE_NASOD"] ] =
{
    COMBO_COMMAND0 = 
    {
        { "Z" },
        { "u", 2, 0, "N"},
        { "R", 3, 0, "ZZZR"},
        { "Z", 0, 1, "Z"},
        { "Z", 1, 1, "ZZ"},
        { "Z", 2, 1, "ZZZ"},
        { "Z", 3, 1, "ZZZZ"},        
        { "m", 2, 2, "N"},
        { "2", 3, 2, "ZZZDownZ"},        
        { "d", 2, 3, "N"},
        { "X", 3, 3, "ZZZX"},
    },

    COMBO_COMMAND1 = 
    {
        { "X" },
        { "u", 1, 0, "N"},
        { "7", 2, 0, "XXRightX"},
        { "X", 4, 0, "XXRightXX"},
        { "X", 0, 1, "X"},
        { "X", 1, 1, "XX"},
        { "X", 2, 1, "XXX"},
        { "d", 1, 2, "N"},        
        { "4", 2, 2, "XXDownX"},       
        { "X", 4, 2, "XXDownXX"},    
    },

    COMBO_COMMAND2 = 
    {
        { "R" },
        { "u", 0, 0, "N"},
        { "J", 1, 0, "A"},
        { "R", 0, 1, "R"},
        { "Z", 1, 1, "RZ"},
        { "d", 0, 2, "N"},
        { "X", 1, 2, "RX"},
    },

    COMBO_COMMAND3 = 
    {
        { "J" },        
        { "u", 0, 0, "N"},
        { "J", 1, 0, "JJ"},
        { "J", 0, 1, "J"},
        { "Z", 1, 1, "JZ"},
        { "m", 0, 2, "N"},
        { "X", 1, 2, "JX"},
        { "d", 0, 3, "N"},
        { "R", 1, 3, "JR"},
    },

    COMBO_COMMAND4 = 
    {
        { "j" },
        { "j", 0, 0, "JJ"},
        { "Z", 2, 0, "JJZ"},
        { "d", 1, 1, "N"},
        { "X", 2, 1, "JJX"},
    },
    
    COMBO_COMMAND5 = 
    {
        { "A" },
        { "A", 0, 0, "A"},
        { "Z", 2, 0, "AZ"},
        { "Z", 3, 0, "AZZ"},
        { "Z", 4, 0, "AZZZ"},
        { "d", 1, 1, "N"},
        { "X", 2, 1, "AX"},
    },
}  
	
--노전직 청
COMBO_GUIDE[ UNIT_CLASS["UC_CHUNG_IRON_CANNON"] ] =
{
    COMBO_COMMAND0 = 
    {
        { "Z" },
		{ "u", 2, 0, "N"},
		{ "X", 3, 0, "ZZZX"},
		{ "Z", 0, 1, "Z"},
        { "Z", 1, 1, "ZZ"},
        { "Z", 2, 1, "ZZZ"},
        { "Z", 3, 1, "ZZZZ"},        
		{ "d", 1, 2, "N"},
		{ "2", 2, 2, "ZZDownZ"},
		{ "Z", 4, 2, "ZZDownZZ"},
    },

    COMBO_COMMAND1 = 
    {
        { "X" },
        { "X", 0, 1, "X"},
        { "X", 1, 1, "XX"},
        { "X", 2, 1, "XXX"},
        { "d", 1, 2, "N"},        
        { "Z", 2, 2, "XXZ"},
		{ "X", 3, 2, "XXZX"},
    },

    COMBO_COMMAND2 = 
    {
        { "R" },
        { "u", 0, 0, "N"},
        { "J", 1, 0, "A"},
        { "R", 0, 1, "R"},
        { "Z", 1, 1, "RZ"},
        { "d", 0, 2, "N"},
        { "X", 1, 2, "RX"},
    },

    COMBO_COMMAND3 = 
    {
        { "J" },
        { "u", 0, 0, "N" },
        { "R", 1, 0, "A" },    
        { "J", 0, 1, "J" },
        { "Z", 1, 1, "JZ" },
        { "d", 0, 2, "N" },
        { "X", 1, 2, "JX" },
        { "D", 1, 3, "D" },
    },

    COMBO_COMMAND4 = 
    {
        { "A" },
        { "u", 1, 0, "N"},
        { "D", 2, 0, "AD"},
        { "A", 0, 1, "A"},
        { "Z", 2, 1, "AZ"},
        { "Z", 3, 1, "AZZ"},
        { "d", 1, 2, "N"},
        { "X", 2, 2, "AX"},
    },
    
    COMBO_COMMAND5 = 
    {
		{ "G" },
		{ "G", 0, 1, "G"},
        { "Z", 1, 1, "Z"},
        { "d", 0, 2, "N"},
        { "X", 1, 2, "X"},
    },
}	
	
	
	
	
  
  

-- 노전직 엘리시스
COMBO_GUIDE[ UNIT_CLASS["UC_ELESIS_KNIGHT"] ] =
{
    COMBO_COMMAND0 = 
    {
        { "Z" },                --루트
        { "u", 2, 0, "N" },     --┌
        { "R", 3, 0, "ZZZR" },  --대시 	
        { "Z", 0, 1, "Z" },     --기본 z
        { "Z", 1, 1, "ZZ" },    --제트 콤보 두번째
        { "Z", 2, 1, "ZZZ" },   --제트 콤보 세개 
        { "Z", 3, 1, "ZZZZ" },  --제트 콤보 4개 
        { "d", 2, 2, "N" },     --아래쪽 꺽쇠 
        { "X", 3, 2, "ZZZX" },  --3,2 좌표에 X
    },
    COMBO_COMMAND1 = 
    {
        { "X" },
        { "X", 0, 0, "X" },
        { "X", 1, 0, "XX" },
        { "X", 2, 0, "XXX" },
        { "d", 1, 1, "N" },
        { "Z", 2, 1, "XXZ" },
    },
    COMBO_COMMAND2 = 
    {
        { "R" },
        { "u", 0, 0, "N" },
        { "J", 1, 0, "A" },
        { "R", 0, 1, "R" },
        { "Z", 1, 1, "RZ" },
        { "Z", 2, 1, "RZZ" },
        { "d", 0, 2, "N" },
        { "X", 1, 2, "RX" },
    },
    COMBO_COMMAND3 = 
    {
        { "J" },
        { "u", 0, 0, "N" },
        { "R", 1, 0, "A" },    
        { "J", 0, 1, "J" },
        { "Z", 1, 1, "JZ" },
        { "d", 0, 2, "N" },
        { "X", 1, 2, "JX" },
    },
    COMBO_COMMAND4 = 
    {
        { "A" },
        { "A", 0, 0, "A" },
        { "Z", 2, 0, "AZ" },
        { "Z", 3, 0, "AZZ" },
        { "Z", 4, 0, "AZZZ" },
        { "d", 1, 1, "N" },
        { "X", 2, 1, "AX" },
        { "X", 3, 1, "AXX" },
    },  
}
--노전직 아라
COMBO_GUIDE[ UNIT_CLASS["UC_ARA_MARTIAL_ARTIST"] ] =
{
    COMBO_COMMAND0 = 
    {
        { "Z" },
		{ "u", 2, 0, "N"},
		{ "X", 3, 0, "ZZZX"},
		{ "Z", 0, 1, "Z"},
        { "Z", 1, 1, "ZZ"},
        { "Z", 2, 1, "ZZZ"},
        { "Z", 3, 1, "ZZZZ"},        
		{ "d", 1, 2, "N"},
		{ "X", 2, 2, "ZZX"},
    },

    COMBO_COMMAND1 = 
    {
        { "X" },
        { "X", 0, 1, "X"},
        { "X", 1, 1, "XX"},
        { "X", 2, 1, "XXX"},
        { "X", 3, 1, "XXXX"},
        { "X", 4, 1, "XXXXX"},
        { "d", 1, 2, "N"},        
        { "4", 2, 2, "XXDownX"},
		{ "X", 4, 2, "XXDownXX"},
    },

    COMBO_COMMAND2 = 
    {
        { "R" },
        { "u", 0, 0, "N"},
        { "J", 1, 0, "A"},
        { "R", 0, 1, "R"},
        { "Z", 1, 1, "RZ"},
        { "X", 2, 1, "RZX"},
        { "d", 0, 2, "N"},
        { "X", 1, 2, "RX"},
    },

    COMBO_COMMAND3 = 
    {
        { "J" },
        { "u", 1, 0, "N" },
        { "Z", 2, 0, "JZ" },
        { "u", 0, 1, "N" },
        { "J", 1, 1, "JJ" },
        { "X", 2, 1, "JX" },
        { "u", 0, 2, "N" },
        { "R", 1, 2, "A" },    
        { "J", 0, 3, "J" },
        { "Z", 1, 3, "JZ" },
        { "d", 0, 4, "N" },
        { "X", 1, 4, "JX" },
        { "D", 1, 5, "D" },
    },

    COMBO_COMMAND4 = 
    {
        { "A" },
        { "u", 2, 0, "AZ"},
        { "Z", 3, 0, "AZ"},
        { "Z", 4, 0, "AZZ"},
        { "Z", 5, 0, "AZZZ"},
        { "u", 1, 1, "N"},
        { "J", 2, 1, "AJ"},
        { "X", 3, 1, "AX"},
        { "A", 0, 2, "A"},
        { "Z", 2, 2, "AZ"},
        { "Z", 3, 2, "AZZ"},
        { "Z", 4, 2, "AZZZ"},
        { "d", 1, 3, "N"},
        { "X", 2, 3, "AX"},
    },
    
    COMBO_COMMAND5 = 
    {
		{ "G" },
		{ "G", 0, 1, "G"},
        { "Z", 1, 1, "Z"},
        { "d", 0, 2, "N"},
        { "X", 1, 2, "X"},
    },
}	
	
	
  
  
 
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
	
	
	
	
	
	